apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
/*
 * Copyright(c) 2007 - 2018 Realtek Corporation. All rights reserved.
 * SPDX-License-Identifier: Apache-2.0 
 * Licensed under the Apache License, Version 2.0 (the License); you may 
 * not use this file except in compliance with the License. 
 * You may obtain a copy of the License at 
 * 
 * http://www.apache.org/licenses/LICENSE-2.0 
 * 
 * Unless required by applicable law or agreed to in writing, software 
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT 
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. 
 * See the License for the specific language governing permissions and 
 * limitations under the License.
 *
 * @file     rtl8710c.h
 * @brief    CMSIS HeaderFile
 * @version  1.0
 * @date     04. June 2018
 * @note     Generated by SVDConv V3.3.13 on Monday, 04.06.2018 21:34:40
 *           from File 'rtl8710c.svd',
 *           last modified on Monday, 04.06.2018 13:34:19
 */



/** @addtogroup Realtek Realtek Semiconductor Corp.
  * @{
  */


/** @addtogroup rtl8710c
  * @{
  */


#ifndef RTL8710C_H
#define RTL8710C_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

enum {
/* ========================================  ARM ARMV8MML Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn     = -12,              /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                     and No Match                                                              */
  BusFault_IRQn             = -11,              /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                     related Fault                                                             */
  UsageFault_IRQn           = -10,              /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SecureFault_IRQn          =  -9,              /*!< -9 Secure Fault Handler                                                   */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn         =  -4,              /*!< -4 Debug Monitor                                                          */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* ==========================================  rtl8710c Specific Interrupt Numbers  ========================================== */
  System_IRQn               =   0,              /*!< 0  System                                                                 */
  TimerGroup0_IRQn          =   1,              /*!< 1  TimerGroup0                                                            */
  TimerGroup1_IRQn          =   2,              /*!< 2  TimerGroup1                                                            */
  GPIO_IRQn                 =   3,              /*!< 3  GPIO                                                                   */
  PWM_IRQn                  =   4,              /*!< 4  PWM                                                                    */
  UART_IRQn                 =   5,              /*!< 5  UART                                                                   */
  SSI_IRQn                  =   6,              /*!< 6  SSI                                                                    */
  I2C_IRQn                  =   7,              /*!< 7  I2C                                                                    */
  GDMA0_IRQn                =   8,              /*!< 8  GDMA0                                                                  */
  LowPri_IRQn               =   9,              /*!< 9  LowPri                                                                 */
  Crypto_IRQn               =  10,              /*!< 10 Crypto                                                                 */
  SDIOD_IRQn                =  11,              /*!< 11 SDIOD                                                                  */
  WLAN_IRQn                 =  12,              /*!< 12 WLAN                                                                   */
  SGDMA0_IRQn               =  13,              /*!< 13 SGDMA0                                                                 */
  SLowPri_IRQn              =  14,              /*!< 14 SLowPri                                                                */
  SCrypto_IRQn              =  15               /*!< 15 SCrypto                                                                */
};
typedef int32_t IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ===========================  Configuration of the ARM ARMV8MML Processor and Core Peripherals  ============================ */
#define __ARMV8MML_REV                 0x0000U  /*!< ARMV8MML Core Revision                                                    */
#define __NVIC_PRIO_BITS               3        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __VTOR_PRESENT                 1        /*!< Set to 1 if CPU supports Vector Table Offset Register                     */
#define __MPU_PRESENT                  1        /*!< MPU present or not                                                        */
#define __FPU_PRESENT                  0        /*!< FPU present or not                                                        */
#define __FPU_DP                       0        /*!< unused, Device has no FPU                                                 */
#define __SAUREGION_PRESENT            1        /*!< SAU present or not                                                        */
#define __DSP_PRESENT                  1        /*!< DSP extension present                                                     */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_armv8mml.h"                      /*!< ARM ARMV8MML processor and core peripherals                               */
#include "system_rtl8710c.h"                    /*!< rtl8710c System                                                           */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                          MiscIRQ                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief System Power Control (MiscIRQ)
  */

