apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
typedef struct {                                /*!< (@ 0x00000000) MiscIRQ Structure                                          */
  
  union {
    __IM  uint32_t dummy_reg;                   /*!< (@ 0x00000000) Registers definition is not exposed                        */
    
    struct {
      __IM  uint32_t temp       : 32;           /*!< [31..0] temp                                                              */
    } dummy_reg_b;
  } ;
} MiscIRQ_Type;                                 /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose I/O (GPIO)
  */

typedef struct {                                /*!< (@ 0x40001000) GPIO Structure                                             */
  
  union {
    __IM  uint32_t it_sts;                      /*!< (@ 0x00000000) GPIO interrupt type status Register                        */
    
    struct {
      __IM  uint32_t gpio_it_sts : 16;          /*!< [15..0] For each bit: 0: the specific GPIO pin is configured
                                                     to edge sensitive interrupt mode 1: the specific GPIO pin
                                                     is configured to levle sensitive interrupt mode.                          */
    } it_sts_b;
  } ;
  
  union {
    __IOM uint32_t ei_en;                       /*!< (@ 0x00000004) GPIO edge sensitive interrupt mode enable                  */
    
    struct {
      __IOM uint32_t ei_en      : 16;           /*!< [15..0] For each bit write: 0: No operation 1: the conrtolled
                                                     GPIO pin is configured as edge sensitive interrupt mode
                                                     and also cause the corresponging bit of REG_GPIO_IT_STS
                                                     to be read as zero.                                                       */
    } ei_en_b;
  } ;
  
  union {
    __IOM uint32_t li_en;                       /*!< (@ 0x00000008) GPIO level sensitive interrupt mode enable                 */
    
    struct {
      __IOM uint32_t li_en      : 16;           /*!< [15..0] For each bit write: 0: No operation 1: the conrtolled
                                                     GPIO pin is configured as level sensitive interrupt mode
                                                     and also cause the corresponging bit of REG_GPIO_IT_STS
                                                     to be read as 1.                                                          */
    } li_en_b;
  } ;
  
  union {
    __IM  uint32_t ip_sts;                      /*!< (@ 0x0000000C) GPIO interrupt polarity status                             */
    
    struct {
      __IM  uint32_t ip_sts0    : 2;            /*!< [1..0] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts1    : 2;            /*!< [3..2] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts2    : 2;            /*!< [5..4] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts3    : 2;            /*!< [7..6] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts4    : 2;            /*!< [9..8] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts5    : 2;            /*!< [11..10] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts6    : 2;            /*!< [13..12] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts7    : 2;            /*!< [15..14] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts8    : 2;            /*!< [17..16] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts9    : 2;            /*!< [19..18] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts10   : 2;            /*!< [21..20] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts11   : 2;            /*!< [23..22] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts12   : 2;            /*!< [25..24] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts13   : 2;            /*!< [27..26] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts14   : 2;            /*!< [29..28] 00: the specific GPIO pin is configured as rising-edge
                                                     (active-high sensitive) 01: the specific GPIO pin is configured
                                                     as falling-edge (active-low sensitive) 10: the specific
                                                     GPIO pin is configured as dual-edge 11: reserved                          */
      __IM  uint32_t ip_sts15   : 2;            /*!< [31..30] The interrupt polarity status of GPIO15                          */
    } ip_sts_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t ir_en;                       /*!< (@ 0x00000014) GPIO interrupt rising-edge enable                          */
    
