apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t ir_en      : 16;           /*!< [15..0] For each bit write: 0: No operation; 1: the conrtolled
                                                     GPIO pin is configured to rising-edge interrupt mode or
                                                     high-level mode (depends on REG_GPIO_IT_STS) and also cause
                                                     the corresponding bits of REG_GPIO_IP_STS to be read as
                                                     00b.                                                                      */
    } ir_en_b;
  } ;
  
  union {
    __IOM uint32_t if_en;                       /*!< (@ 0x00000018) GPIO interrupt falling-edge enable                         */
    
    struct {
      __IOM uint32_t if_en      : 16;           /*!< [15..0] For each bit write: 0: No operation; 1: the conrtolled
                                                     GPIO pin is configured to falling-edge interrupt mode or
                                                     low-level interrupt mode (depends on REG_GPIO_IT_STS) and
                                                     cause the corresponding bits of REG_GPIO_IP_STS to be read
                                                     as 01b.                                                                   */
    } if_en_b;
  } ;
  
  union {
    __IOM uint32_t id_en;                       /*!< (@ 0x0000001C) GPIO interrupt dual-edge enable                            */
    
    struct {
      __IOM uint32_t id_en      : 16;           /*!< [15..0] For each bit write: 0: No operation; 1: the conrtolled
                                                     GPIO pin is configured to dual-edge interrupt mode and
                                                     also cause the corresponding bits of REG_GPIO_IP_STS to
                                                     be read as 10b.                                                           */
    } id_en_b;
  } ;
  
  union {
    __IM  uint32_t ie_sts;                      /*!< (@ 0x00000020) GPIO interrupt enable status                               */
    
    struct {
      __IM  uint32_t ie_sts     : 16;           /*!< [15..0] For each bit: 0: the interrupt of the specific GPIO
                                                     pin is disabled 1: the interrupt of the specific GPIO pin
                                                     is enabled                                                                */
    } ie_sts_b;
  } ;
  
  union {
    __IOM uint32_t int_en;                      /*!< (@ 0x00000024) GPIO interrupt enable                                      */
    
    struct {
      __IOM uint32_t int_en     : 16;           /*!< [15..0] For each bit write: 0: No operation 1: to enable the
                                                     specific GPIO INT and also cause the specified bit of REG_GPIO_IE_STS
                                                     to be read as ONE.                                                        */
    } int_en_b;
  } ;
  
  union {
    __IOM uint32_t int_dis;                     /*!< (@ 0x00000028) GPIO interrupt disable                                     */
    
    struct {
      __IOM uint32_t int_dis    : 16;           /*!< [15..0] For each bit write: 0: No operation 1: to disable the
                                                     specified GPIO INT and also cause the specified bit of
                                                     REG_GPIO_IE_STS to be read as ZERO.                                       */
    } int_dis_b;
  } ;
  
  union {
    __IM  uint32_t int_raw_sts;                 /*!< (@ 0x0000002C) GPIO RAW interrupt status                                  */
    
    struct {
      __IM  uint32_t int_raw_sts : 16;          /*!< [15..0] For each bit: 0: the specified GPIO pin has no pending
                                                     interrupt 1: the specified GPIO pin's interrupt is pending
                                                     (permasking)                                                              */
    } int_raw_sts_b;
  } ;
  
  union {
    __IM  uint32_t int_sts;                     /*!< (@ 0x00000030) GPIO interrupt status                                      */
    
    struct {
      __IM  uint32_t int_sts    : 16;           /*!< [15..0] For each bit: 0: the specified GPIO pin has no pending
                                                     interrupt 1: the specified GPIO pin's interrupt is pending                */
    } int_sts_b;
  } ;
  
  union {
    __IOM uint32_t int_clr;                     /*!< (@ 0x00000034) GPIO interrupt status clear                                */
    
    struct {
      __IOM uint32_t int_clr    : 16;           /*!< [15..0] For each bit writting: 0: No operation; 1: Clear edge
                                                     type pending interrupt of the conrtolled GPIO pin and clear
                                                     the specified bits of REG_GPIO_INT_STS as ZERO                            */
    } int_clr_b;
  } ;
  
  union {
    __IM  uint32_t int_func_en_sts;             /*!< (@ 0x00000038) GPIO interrupt function enable status                      */
    
    struct {
      __IM  uint32_t int_en_sts : 16;           /*!< [15..0] For each bit: 0: the specified GPIO INT is Disable 1:
                                                     the specified GPIO INT is Enable                                          */
    } int_func_en_sts_b;
  } ;
  
  union {
    __IOM uint32_t int_func_en;                 /*!< (@ 0x0000003C) GPIO interrupt function enable                             */
    
    struct {
      __IOM uint32_t int_en     : 16;           /*!< [15..0] For each bit write: 0: No operation 1: the specified
                                                     GPIO INT is enabled and also cause the specified bit of
                                                     REG_GPIO_INT_FUNC_EN_STS to be read as ONE.                               */
    } int_func_en_b;
  } ;
  
  union {
    __IOM uint32_t int_func_dis;                /*!< (@ 0x00000040) GPIO interrupt function disable                            */
    
