apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t int_dis    : 16;           /*!< [15..0] For each bit write: 0: No operation 1: the specified
                                                     GPIO INT is disabled and also cause the specified bit of
                                                     REG_GPIO_INT_FUNC_EN_STS to be read as ZERO.                              */
    } int_func_dis_b;
  } ;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t int0_sel;                    /*!< (@ 0x00000050) GPIO INT0 selection                                        */
    
    struct {
      __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT0                      */
      __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT0                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT0                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                     1: Using debounce output signal as interrupt signal source                */
    } int0_sel_b;
  } ;
  
  union {
    __IOM uint32_t int1_sel;                    /*!< (@ 0x00000054) GPIO INT1 selection                                        */
    
    struct {
      __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT1                      */
      __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT1                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT1                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                     1: Using debounce output signal as interrupt signal source                */
    } int1_sel_b;
  } ;
  
  union {
    __IOM uint32_t int2_sel;                    /*!< (@ 0x00000058) GPIO INT2 selection                                        */
    
    struct {
      __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT2                      */
      __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT2                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT2                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                     1: Using debounce output signal as interrupt signal source                */
    } int2_sel_b;
  } ;
  
  union {
    __IOM uint32_t int3_sel;                    /*!< (@ 0x0000005C) GPIO INT3 selection                                        */
    
    struct {
      __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT3                      */
      __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT3                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT3                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                     1: Using debounce output signal as interrupt signal source                */
    } int3_sel_b;
  } ;
  
  union {
    __IOM uint32_t int4_sel;                    /*!< (@ 0x00000060) GPIO INT4 selection                                        */
    
    struct {
      __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT4                      */
      __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT4                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT4                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                     1: Using debounce output signal as interrupt signal source                */
    } int4_sel_b;
  } ;
  
  union {
    __IOM uint32_t int5_sel;                    /*!< (@ 0x00000064) GPIO INT5 selection                                        */
    
    struct {
      __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT5                      */
      __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT5                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT5                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                     1: Using debounce output signal as interrupt signal source                */
    } int5_sel_b;
  } ;
  
  union {
    __IOM uint32_t int6_sel;                    /*!< (@ 0x00000068) GPIO INT6 selection                                        */
    
    struct {
      __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT6                      */
      __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT6                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT6                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                     1: Using debounce output signal as interrupt signal source                */
    } int6_sel_b;
  } ;
  
  union {
    __IOM uint32_t int7_sel;                    /*!< (@ 0x0000006C) GPIO INT7 selection                                        */
    
