apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT14                     */
      __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT14                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT14                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                     1: Using debounce output signal as interrupt signal source                */
    } int14_sel_b;
  } ;
  
  union {
    __IOM uint32_t int15_sel;                   /*!< (@ 0x0000008C) GPIO INT15 selection                                       */
    
    struct {
      __IOM uint32_t int_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for GPIO INT15                     */
      __IOM uint32_t int_gp_sel : 2;            /*!< [6..5] GPIO port selection for GPIO INT15                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t int_deb_sel : 4;           /*!< [11..8] Debounce Output signal selection for GPIO INT15                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t int_sur_sel : 1;           /*!< [15..15] 0: Useing pin input signal as interrupt signal source
                                                     1: Using debounce output signal as interrupt signal source                */
    } int15_sel_b;
  } ;
  __IM  uint32_t  RESERVED2[24];
  
  union {
    __IM  uint32_t deb_sts;                     /*!< (@ 0x000000F0) GPIO port debounce status                                  */
    
    struct {
      __IM  uint32_t deb_sts    : 16;           /*!< [15..0] For each bit: 0: the specific GPIO debounce pin is DISABLE
                                                     debounce 1: the specific GPIO debounce pin is ENABLE debounce             */
    } deb_sts_b;
  } ;
  
  union {
    __IOM uint32_t deb_en;                      /*!< (@ 0x000000F4) GPIO debounce pin enable                                   */
    
    struct {
      __IOM uint32_t deb_en     : 16;           /*!< [15..0] For each bit write: 0: No operation 1: the conrtolled
                                                     GPIO de-bouncing pin is enabled and also cause the specified
                                                     bit of REG_GPIO_DEB_STS to be read as ONE.                                */
    } deb_en_b;
  } ;
  
  union {
    __IOM uint32_t deb_dis;                     /*!< (@ 0x000000F8) GPIO debounce pin disable                                  */
    
    struct {
      __IOM uint32_t deb_dis    : 16;           /*!< [15..0] For each bit write: 0: No operation 1: the conrtolled
                                                     GPIO de-bouncing pin is disabled and also cause the specified
                                                     bit of REG_GPIO_DEB_STS to be read as ZERO.                               */
    } deb_dis_b;
  } ;
  
  union {
    __IM  uint32_t deb_dp_sts;                  /*!< (@ 0x000000FC) GPIO debounce data pin status                              */
    
    struct {
      __IM  uint32_t deb_dp_sts : 16;           /*!< [15..0] For each bit reading: read the signal level of the specified
                                                     pin after de-bounce                                                       */
    } deb_dp_sts_b;
  } ;
  
  union {
    __IOM uint32_t deb0_sel;                    /*!< (@ 0x00000100) GPIO debounce0 selection                                   */
    
    struct {
      __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce0                      */
      __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce0                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                     cycles given in this field.                                               */
    } deb0_sel_b;
  } ;
  
  union {
    __IOM uint32_t deb1_sel;                    /*!< (@ 0x00000104) GPIO debounce1 selection                                   */
    
    struct {
      __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce1                      */
      __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce1                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                     cycles given in this field.                                               */
    } deb1_sel_b;
  } ;
  
  union {
    __IOM uint32_t deb2_sel;                    /*!< (@ 0x00000108) GPIO debounce2 selection                                   */
    
    struct {
      __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce2                      */
      __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce2                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                     cycles given in this field.                                               */
    } deb2_sel_b;
  } ;
  
  union {
    __IOM uint32_t deb3_sel;                    /*!< (@ 0x0000010C) GPIO debounce3 selection                                   */
    
    struct {
      __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce3                      */
      __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce3                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                     cycles given in this field.                                               */
    } deb3_sel_b;
  } ;
  
  union {
    __IOM uint32_t deb4_sel;                    /*!< (@ 0x00000110) GPIO debounce4 selection                                   */
    
