apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce13                     */
      __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce13                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                     cycles given in this field.                                               */
    } deb13_sel_b;
  } ;
  
  union {
    __IOM uint32_t deb14_sel;                   /*!< (@ 0x00000138) GPIO debounce14 selection                                  */
    
    struct {
      __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce14                     */
      __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce14                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                     cycles given in this field.                                               */
    } deb14_sel_b;
  } ;
  
  union {
    __IOM uint32_t deb15_sel;                   /*!< (@ 0x0000013C) GPIO debounce15 selection                                  */
    
    struct {
      __IOM uint32_t deb_mer_sel : 5;           /*!< [4..0] Pin selection of specified port for debounce15                     */
      __IOM uint32_t deb_gp_sel : 2;            /*!< [6..5] GPIO port selection for debounce15                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t deb_cyc    : 14;           /*!< [21..8] The GPIO signal will be filtered by the number of debounce
                                                     cycles given in this field.                                               */
    } deb15_sel_b;
  } ;
  __IM  uint32_t  RESERVED3[48];
  
  union {
    __IM  uint32_t port_a_dmd_sts;              /*!< (@ 0x00000200) GPIO port A data mode direction status                     */
    
    struct {
      __IM  uint32_t dmd_sts    : 32;           /*!< [31..0] For each bit: 0: the specific GPIO pin is configured
                                                     to INPUT data mode 1: the specific GPIO pin is configured
                                                     to OUTPUT data mode                                                       */
    } port_a_dmd_sts_b;
  } ;
  
  union {
    __IOM uint32_t port_a_idm_en;               /*!< (@ 0x00000204) GPIO port A input data mode enable                         */
    
    struct {
      __IOM uint32_t idm_en     : 32;           /*!< [31..0] For each bit write: 0: the configuration of the conrtolled
                                                     GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured
                                                     to input data mode and also cause the specified bit of
                                                     REG_PORT_A_DMD_STS to be read as zero.                                    */
    } port_a_idm_en_b;
  } ;
  
  union {
    __IOM uint32_t port_a_odm_en;               /*!< (@ 0x00000208) GPIO port A output data mode enable                        */
    
    struct {
      __IOM uint32_t odm_en     : 32;           /*!< [31..0] For each bit write: 0: the configuration of conrtolled
                                                     GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured
                                                     as output data mode and also cause the specified bit of
                                                     REG_PORT_A_DMD_STS to be read as one                                      */
    } port_a_odm_en_b;
  } ;
  
  union {
    __IM  uint32_t port_a_od_sts;               /*!< (@ 0x0000020C) GPIO port A output data status                             */
    
    struct {
      __IM  uint32_t od_sts     : 32;           /*!< [31..0] For each bit: 0: the specified GPIO pin is configured
                                                     as output low 1: the specified GPIO pin is configured as
                                                     output high , if the specific GPIO pin is output data mode.               */
    } port_a_od_sts_b;
  } ;
  
  union {
    __IOM uint32_t port_a_odl_en;               /*!< (@ 0x00000210) GPIO port A output data low enable                         */
    
    struct {
      __IOM uint32_t odl_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: the conrtolled
                                                     GPIO pin is configured as output low and also cause the
                                                     specified bit of REG_PORT_A_OD_STS is zero.                               */
    } port_a_odl_en_b;
  } ;
  
  union {
    __IOM uint32_t port_a_odh_en;               /*!< (@ 0x00000214) GPIO port A output data high enable                        */
    
    struct {
      __IOM uint32_t odh_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: the conrtolled
                                                     GPIO pin is configured as output high and also cause the
                                                     specified bit of REG_PORT_A_OD_STS is one.                                */
    } port_a_odh_en_b;
  } ;
  
  union {
    __IOM uint32_t port_a_odt_en;               /*!< (@ 0x00000218) GPIO port A output data toggle enable                      */
    
    struct {
      __IOM uint32_t odt_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: Toggle output
                                                     of the conrtolled GPIO pin and the specified bit of REG_PORT_A_OD_STS
                                                     also will be toggled.                                                     */
    } port_a_odt_en_b;
  } ;
  
  union {
    __IM  uint32_t port_a_dp_sts;               /*!< (@ 0x0000021C) GPIO port A data pin status                                */
    
