apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IM  uint32_t dp_sts     : 32;           /*!< [31..0] For each bit reading: If the direction of the specified
                                                     bit is input then read the signal level of the input pin.
                                                     If the direction of the specified bit is output then reads
                                                     the output data register for port A.                                      */
    } port_a_dp_sts_b;
  } ;
  __IM  uint32_t  RESERVED4[8];
  
  union {
    __IM  uint32_t port_b_dmd_sts;              /*!< (@ 0x00000240) GPIO port B data mode direction status                     */
    
    struct {
      __IM  uint32_t dmd_sts    : 32;           /*!< [31..0] For each bit: 0: the specific GPIO pin is configured
                                                     to INPUT data mode 1: the specific GPIO pin is configured
                                                     to OUTPUT data mode                                                       */
    } port_b_dmd_sts_b;
  } ;
  
  union {
    __IOM uint32_t port_b_idm_en;               /*!< (@ 0x00000244) GPIO port B input data mode enable                         */
    
    struct {
      __IOM uint32_t idm_en     : 32;           /*!< [31..0] For each bit write: 0: the configuration of the conrtolled
                                                     GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured
                                                     to input data mode and also cause the specified bit of
                                                     REG_PORT_B_DMD_STS to be read as zero.                                    */
    } port_b_idm_en_b;
  } ;
  
  union {
    __IOM uint32_t port_b_odm_en;               /*!< (@ 0x00000248) GPIO port B output data mode enable                        */
    
    struct {
      __IOM uint32_t odm_en     : 32;           /*!< [31..0] For each bit write: 0: the configuration of the conrtolled
                                                     GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured
                                                     as output data mode and also cause the specified bit of
                                                     REG_PORT_B_DMD_STS to be read as one                                      */
    } port_b_odm_en_b;
  } ;
  
  union {
    __IM  uint32_t port_b_od_sts;               /*!< (@ 0x0000024C) GPIO port B output data status                             */
    
    struct {
      __IM  uint32_t od_sts     : 32;           /*!< [31..0] For each bit: 0: the specified GPIO pin is configured
                                                     as output low 1: the specified GPIO pin is configured as
                                                     output high , if the specific GPIO pin is output data mode.               */
    } port_b_od_sts_b;
  } ;
  
  union {
    __IOM uint32_t port_b_odl_en;               /*!< (@ 0x00000250) GPIO port B output data low enable                         */
    
    struct {
      __IOM uint32_t odl_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: the conrtolled
                                                     GPIO pin is configured as output low and also cause the
                                                     specified bit of REG_PORT_B_OD_STS is zero.                               */
    } port_b_odl_en_b;
  } ;
  
  union {
    __IOM uint32_t port_b_odh_en;               /*!< (@ 0x00000254) GPIO port B output data high enable                        */
    
    struct {
      __IOM uint32_t odh_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: the conrtolled
                                                     GPIO pin is configured as output high and also cause the
                                                     specified bit of REG_PORT_B_OD_STS is one.                                */
    } port_b_odh_en_b;
  } ;
  
  union {
    __IOM uint32_t port_b_odt_en;               /*!< (@ 0x00000258) GPIO port B output data toggle enable                      */
    
    struct {
      __IOM uint32_t odt_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: Toggle output
                                                     of the conrtolled GPIO pin and the specified bit of REG_PORT_B_OD_STS
                                                     also will be toggled.                                                     */
    } port_b_odt_en_b;
  } ;
  
  union {
    __IM  uint32_t port_b_dp_sts;               /*!< (@ 0x0000025C) GPIO port B data pin status                                */
    
    struct {
      __IM  uint32_t dp_sts     : 32;           /*!< [31..0] For each bit reading: If the direction of the specified
                                                     bit is input then read the signal level of the input pin.
                                                     If the direction of the specified bit is output then reads
                                                     the output data register for port B.                                      */
    } port_b_dp_sts_b;
  } ;
  __IM  uint32_t  RESERVED5[8];
  
  union {
    __IM  uint32_t port_c_dmd_sts;              /*!< (@ 0x00000280) GPIO port C data mode direction status                     */
    
    struct {
      __IM  uint32_t dmd_sts    : 32;           /*!< [31..0] For each bit: 0: the specific GPIO pin is configured
                                                     to INPUT data mode 1: the specific GPIO pin is configured
                                                     to OUTPUT data mode                                                       */
    } port_c_dmd_sts_b;
  } ;
  
  union {
    __IOM uint32_t port_c_idm_en;               /*!< (@ 0x00000284) GPIO port C input data mode enable                         */
    
    struct {
      __IOM uint32_t idm_en     : 32;           /*!< [31..0] For each bit write: 0: the configuration of the conrtolled
                                                     GPIO pin is unchanged; 1: the conrtolled GPIO pin is configured
                                                     to input data mode and also cause the specified bit of
                                                     REG_PORT_C_DMD_STS to be read as zero.                                    */
    } port_c_idm_en_b;
  } ;
  
  union {
    __IOM uint32_t port_c_odm_en;               /*!< (@ 0x00000288) GPIO port C output data mode enable                        */
    
