apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t odh_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: the conrtolled
                                                     GPIO pin is configured as output high and also cause the
                                                     specified bit of REG_PORT_D_OD_STS is one.                                */
    } port_d_odh_en_b;
  } ;
  
  union {
    __IOM uint32_t port_d_odt_en;               /*!< (@ 0x000002D8) GPIO port D output data toggle enable                      */
    
    struct {
      __IOM uint32_t odt_en     : 32;           /*!< [31..0] For each bit write: 0: No operation 1: Toggle output
                                                     of the conrtolled GPIO pin and the specified bit of REG_PORT_D_OD_STS
                                                     also will be toggled.                                                     */
    } port_d_odt_en_b;
  } ;
  
  union {
    __IM  uint32_t port_d_dp_sts;               /*!< (@ 0x000002DC) GPIO port D data pin status                                */
    
    struct {
      __IM  uint32_t dp_sts     : 32;           /*!< [31..0] For each bit reading: If the direction of the specified
                                                     bit is input then read the signal level of the input pin.
                                                     If the direction of the specified bit is output then reads
                                                     the output data register for port D.                                      */
    } port_d_dp_sts_b;
  } ;
} GPIO_Type;                                    /*!< Size = 736 (0x2e0)                                                        */



/* =========================================================================================================================== */
/* ================                                            TG0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose Timer Group 0 Control (TG0)
  */

typedef struct {                                /*!< (@ 0x40003800) TG0 Structure                                              */
  
  union {
    __IM  uint32_t ists;                        /*!< (@ 0x00000000) Timer Group interrupt status register                      */
    
    struct {
      __IM  uint32_t ists       : 8;            /*!< [7..0] Each bit indicates the interrupt pending status of corresponding
                                                     timer: 0: the specifiied timer has no interrupt pending
                                                     1: the specifiied timer has pending interrupt                             */
    } ists_b;
  } ;
  
  union {
    __IM  uint32_t raw_ists;                    /*!< (@ 0x00000004) Timer Group raw interrupt status register                  */
    
    struct {
      __IM  uint32_t rists      : 8;            /*!< [7..0] Each bit indicates the interrupt pending status of corresponding
                                                     timer: 0: the specifiied timer has no interrupt pending
                                                     1: the specifiied timer has pending interrupt (pre-masing)                */
    } raw_ists_b;
  } ;
  
  union {
    __IOM uint32_t tsel;                        /*!< (@ 0x00000008) Timer Group indirect read control register                 */
    
    struct {
      __IOM uint32_t tsel       : 3;            /*!< [2..0] The timer index in a timer group, to select the timer
                                                     for indirect read.                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t sync_mode  : 1;            /*!< [4..4] Sync mode between Timer clock and APB clock 0: Freq.
                                                     of APB clock >> Freq. of Timer clock (about 10 times) 1:
                                                     others                                                                    */
      __IM  uint32_t            : 2;
      __IOM uint32_t poll       : 1;            /*!< [7..7] Set this bit to enable indirect read current value of
                                                     timer selected by tsel. This bit is cleared by HW while
                                                     finishing read and indicate REG_TIMER_TC is ready                         */
    } tsel_b;
  } ;
  
  union {
    __IM  uint32_t tc;                          /*!< (@ 0x0000000C) Timer Group indirect read timer counter register           */
    
    struct {
      __IM  uint32_t timer_tc   : 32;           /*!< [31..0] Current counter value of the specifiied timer by register
                                                     tg_tsel.                                                                  */
    } tc_b;
  } ;
} TG0_Type;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            TM0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief General Purpose Timer0 (TM0)
  */

typedef struct {                                /*!< (@ 0x40002040) TM0 Structure                                              */
  
  union {
    __IOM uint32_t lc;                          /*!< (@ 0x00000000) Timer load count register                                  */
    
    struct {
      __IOM uint32_t lc         : 32;           /*!< [31..0] The counter value to be loaded into the timer counter
                                                     when timer is enabled or reset. Min = 0, when prescaler
                                                     register > 0; otherwise Min = 1.                                          */
    } lc_b;
  } ;
  
  union {
    __IOM uint32_t tc;                          /*!< (@ 0x00000004) Timer current counter register                             */
    
