apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t tc         : 32;           /*!< [31..0] Current counter value.                                            */
    } tc_b;
  } ;
  
  union {
    __IOM uint32_t pc;                          /*!< (@ 0x00000008) Timer prescaler counter register                           */
    
    struct {
      __IOM uint32_t pc         : 10;           /*!< [9..0] Pre-scaler counter will be increased every clock after
                                                     timer is enabled. When the prescaler counter is equal to
                                                     PR, the next clock increments (decrements) the TC and clears
                                                     the PC.                                                                   */
    } pc_b;
  } ;
  
  union {
    __IOM uint32_t pr;                          /*!< (@ 0x0000000C) Timer prescaler register                                   */
    
    struct {
      __IOM uint32_t pr         : 10;           /*!< [9..0] When the PC is equal to this value, the next clock increments
                                                     (decrements) the TC and clears the PC.                                    */
    } pr_b;
  } ;
  
  union {
    __IOM uint32_t ctrl;                        /*!< (@ 0x00000010) Timer control register                                     */
    
    struct {
      __IOM uint32_t en         : 1;            /*!< [0..0] Timer enable control: 0: Disable 1: Enable                         */
      __IOM uint32_t mod        : 1;            /*!< [1..1] Timer operation mode: 0: timer mode (periodical mode);
                                                     it reloads LC to TC and repeat the process according to
                                                     the setting when the timeout event occurred. 1: counter
                                                     mode (one-shot mode); only one time process.                              */
      __IOM uint32_t imr        : 1;            /*!< [2..2] Timer Interrupt mask: 0: disable interrupt 1: enable
                                                     interrupt                                                                 */
      __IOM uint32_t cnt_mod    : 1;            /*!< [3..3] Timer counting mode: 0: Up-counter 1: Down-counter                 */
    } ctrl_b;
  } ;
  
  union {
    __IOM uint32_t isr;                         /*!< (@ 0x00000014) Timer0 interrupt status register                           */
    
    struct {
      __IOM uint32_t timeout    : 1;            /*!< [0..0] Timeout interrupt                                                  */
      __IOM uint32_t match_ev0  : 1;            /*!< [1..1] Counter value match event0 interrupt.                              */
      __IOM uint32_t match_ev1  : 1;            /*!< [2..2] Counter value match event1 interrupt.                              */
      __IOM uint32_t match_ev2  : 1;            /*!< [3..3] Counter value match event2 interrupt.                              */
      __IOM uint32_t match_ev3  : 1;            /*!< [4..4] Counter value match event3 interrupt.                              */
    } isr_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t mectrl;                      /*!< (@ 0x0000001C) Timer match event control register                         */
    
    struct {
      __IOM uint32_t me0_en     : 1;            /*!< [0..0] Counter value match event0 enable control: 0: Disable
                                                     1: Enable                                                                 */
      __IOM uint32_t me1_en     : 1;            /*!< [1..1] Counter value match event1 enable control: 0: Disable
                                                     1: Enable                                                                 */
      __IOM uint32_t me2_en     : 1;            /*!< [2..2] Counter value match event2 enable control: 0: Disable
                                                     1: Enable                                                                 */
      __IOM uint32_t me3_en     : 1;            /*!< [3..3] Counter value match event3 enable control: 0: Disable
                                                     1: Enable                                                                 */
    } mectrl_b;
  } ;
  
  union {
    __IOM uint32_t me0;                         /*!< (@ 0x00000020) Timer match event0 counter register                        */
    
    struct {
      __IOM uint32_t me0        : 32;           /*!< [31..0] Timer counter value for metch event0.                             */
    } me0_b;
  } ;
  
  union {
    __IOM uint32_t me1;                         /*!< (@ 0x00000024) Timer match event1 counter register                        */
    
    struct {
      __IOM uint32_t me1        : 32;           /*!< [31..0] Timer counter value for metch event1.                             */
    } me1_b;
  } ;
  
  union {
    __IOM uint32_t me2;                         /*!< (@ 0x00000028) Timer match event2 counter register                        */
    
    struct {
      __IOM uint32_t me2        : 32;           /*!< [31..0] Timer counter value for metch event2.                             */
    } me2_b;
  } ;
  
  union {
    __IOM uint32_t me3;                         /*!< (@ 0x0000002C) Timer match event3 counter register                        */
    
    struct {
      __IOM uint32_t me3        : 32;           /*!< [31..0] Timer counter value for metch event3.                             */
    } me3_b;
  } ;
} TM0_Type;                                     /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                         PWM_COMM                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief PWM Group Control (PWM_COMM)
  */

typedef struct {                                /*!< (@ 0x40001C00) PWM_COMM Structure                                         */
  
  union {
    __IM  uint32_t enable_status;               /*!< (@ 0x00000000) PWM enable status Register                                 */
    
