apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IM  uint32_t pwm_en_sts : 8;            /*!< [7..0] Each bit indicates the enabling status of corresponding
                                                     PWM: 0: the specific PWM is Disabled 1: the specific PWM
                                                     is Enabled                                                                */
    } enable_status_b;
  } ;
  
  union {
    __IOM uint32_t enable_ctrl;                 /*!< (@ 0x00000004) PWM enable Register                                        */
    
    struct {
      __IOM uint32_t pwm_en     : 8;            /*!< [7..0] Each bit is used to enablel the corresponding PWM function:
                                                     When wrote 0: No operation 1: the specific PWM is enabled
                                                     and the specific bit of REG_PWM_EN_STS is ONE.                            */
    } enable_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t disable_ctrl;                /*!< (@ 0x00000008) PWM disable Register                                       */
    
    struct {
      __IOM uint32_t pwm_dis    : 8;            /*!< [7..0] Each bit is used to enablel the corresponding PWM function:
                                                     When wrote 0: No operation 1: the conrtolled PWM is disabled
                                                     and the specific bit of REG_PWM_EN_STS is ZERO.                           */
    } disable_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t int_status;                  /*!< (@ 0x0000000C) Timer Group indirect read control register                 */
    
    struct {
      __IOM uint32_t duty_adj_dn_lim : 8;       /*!< [7..0] To indicate the interrupt pending status for PWM 0 ~
                                                     7 duty auto-adjustment reaches the down-limit. Write 1
                                                     clear. Bit 0 for PWM0, bit 1 for PWM1, ...bit7 for PWM7.                  */
      __IM  uint32_t            : 8;
      __IOM uint32_t duty_adj_up_lim : 8;       /*!< [23..16] To indicate the interrupt pending status for PWM 0
                                                     ~ 7 duty auto-adjustment reaches the up-limit. Write 1
                                                     clear. Bit 16 for PWM0, bit 17 for PWM1, ...bit23 for PWM7.               */
      __IOM uint32_t period_end : 8;            /*!< [31..24] To indicate the interrupt pending status for PWM 0
                                                     ~7 period end. Write 1 clear. Bit 24 for PWM0, bit 25 for
                                                     PWM1, ...bit31 for PWM7.                                                  */
    } int_status_b;
  } ;
  
  union {
    __IOM uint32_t indread_idx;                 /*!< (@ 0x00000010) PWM Index of Indirect Read Register                        */
    
    struct {
      __IOM uint32_t pwm_sel    : 3;            /*!< [2..0] This field is used to assign the PWM index (0 ~ 7) for
                                                     the auto adjusted duty size indirect reading.                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t sync_mode  : 1;            /*!< [4..4] Register sync mode selection for PWM clock and APB clock
                                                     0: Freq. of APB clock >> Freq. of PWM clock (about 10 times)
                                                     1: Freq. of PWM clock >= Freq. of APB clock                               */
      __IM  uint32_t            : 2;
      __IOM uint32_t pool       : 1;            /*!< [7..7] Set this bit to enable indirect read current value of
                                                     timer selected by BIT_PWM_INDREAD_IDX. This bit is cleared
                                                     by HW when reading is finished and indicates REG_PERI_PWM_INDREAD_DUTY
                                                     is ready.                                                                 */
    } indread_idx_b;
  } ;
  
  union {
    __IOM uint32_t indread_duty;                /*!< (@ 0x00000014) PWM Auto Adjusted Duty Indirect Read Register              */
    
    struct {
      __IOM uint32_t pwm_duty   : 12;           /*!< [11..0] This field is used to read the auto adjusted duty size
                                                     of the PWM which is assigned by the pwm_sel. The SW should
                                                     assign the PWM to read by write the pwm_sel and then read
                                                     this field to get the current duty size of the specified
                                                     PWM.                                                                      */
    } indread_duty_b;
  } ;
} PWM_COMM_Type;                                /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                           PWM0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Pulse Width Modulation 0 (PWM0)
  */

typedef struct {                                /*!< (@ 0x40001C20) PWM0 Structure                                             */
  
  union {
    __IOM uint32_t ctrl;                        /*!< (@ 0x00000000) PWM Control Register                                       */
    
    struct {
      __IOM uint32_t duty       : 12;           /*!< [11..0] The on-duty duration of PWM pulse. The time unit is
                                                     configured by the GTIMER which is specified by clk_sel
                                                     field. It can be written at any time, but HW will apply
                                                     the changing at PWM enable time or at the end of PWM period.              */
      __IOM uint32_t clk_sel    : 4;            /*!< [15..12] The tick source selection, G-timer 0 ~ 7 or SClk: 0:
                                                     GTIMER 0 1: GTIMER 1 ... 7: GTIMER 7 8: sclk                              */
      __IM  uint32_t cur_duty   : 12;           /*!< [27..16] The current duty size which is adjusted by the duty
                                                     auto-adjustment HW. The SW can read this field to know
                                                     the current duty size. However, the latest duty size may
                                                     not be sync to this field on time or the value may transition
                                                     while the SW is reading this field. So use in-direct read
                                                     method to read the duty size is more save and is suggested.               */
      __IOM uint32_t period_ie  : 1;            /*!< [28..28] This bit control the PWM period end interrupt enable
                                                     (1) or disable (0). When the PWM period end interrupt is
                                                     enabled, the PWM HW will assert the interrupt on every
                                                     PWM period end time. This interrupt status can be read
                                                     from pwm_int_status.                                                      */
      __IM  uint32_t run_sts    : 1;            /*!< [29..29] The PWM output running status: 0: PWM output is paused
                                                     1: the PWM output is running.                                             */
      __IOM uint32_t pause      : 1;            /*!< [30..30] The paus control: 0: Normal running 1: To pause the
                                                     PWM out at current PWM period end. Since the PWM output
                                                     is not stopped immediately, the software can poll the BIT_PERI_PWMx_RUNST
                                                     to know the PWM out is still running or is paused.                        */
      __IOM uint32_t ctrl_set   : 1;            /*!< [31..31] SW can change setting only at ctrl_set = 0, and set
                                                     ctrl_set = 1 after changing PWM Ctrl. HW will clear ctrl_set
                                                     bit after changing PWM Ctrl. PS. If this PWM is disabled
                                                     (PWMx_EN=0), the HW will not clear this bit. PS. if this
                                                     bit is asserted and the duty auto adjustment is enabled,
                                                     when the PWM is enabled the HW will updates its duty at
                                                     the 1st PWM period and then start the duty adjustment at
                                                     2nd PWM period.                                                           */
    } ctrl_b;
  } ;
  
  union {
    __IOM uint32_t timing_ctrl;                 /*!< (@ 0x00000004) PWM Timing Control Register                                */
    
