apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t period     : 12;           /*!< [11..0] The period of PWM pulse. The time unit is configured
                                                     by the GTIMER which is specified by the clk_sel field.
                                                     It can be written at any time, but the HW will apply the
                                                     changing at PWM enable time or at the end of PWM period.                  */
      __IM  uint32_t            : 4;
      __IOM uint32_t duty_start : 12;           /*!< [27..16] The start of ON duration of PWM pulse in the period.
                                                     The time unit is the same as PWM period. It can be written
                                                     at any time, but HW change setting only at PWM enable and
                                                     the end of period.                                                        */
    } timing_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t auto_adj_ctrl;               /*!< (@ 0x00000008) PWM Duty Auto Adjustment Control Register                  */
    
    struct {
      __IOM uint32_t duty_dec_step : 10;        /*!< [9..0] The Duty Decreasing Step size of the Duty Auto Adjustment.         */
      __IM  uint32_t            : 2;
      __IOM uint32_t duty_inc_step : 10;        /*!< [21..12] The Duty Increasing Step size of the Duty Auto Adjustment        */
      __IM  uint32_t            : 5;
      __IOM uint32_t duty_dn_lim_ie : 1;        /*!< [27..27] This bit is used to enable the Interrupt of the Duty
                                                     Auto Adjustment. 0: Disable 1: Enable If the Interrupt
                                                     is enabled, issue an interrupt when the Adjusted Duty reach
                                                     the Down Limit.                                                           */
      __IOM uint32_t duty_up_lim_ie : 1;        /*!< [28..28] This bit is used to enable the Interrupt of the Duty
                                                     Auto Adjustment. 0: Disable 1: Enable If the Interrupt
                                                     is enabled, issue an interrupt when the Adjusted Duty reach
                                                     the Up Limit.                                                             */
      __IOM uint32_t adj_loop_en : 1;           /*!< [29..29] This bit is used to enable the Duty Auto Adjustment
                                                     Loop mode. 0: Disable 1: Enable If the Loop Mode is enabled,
                                                     reverse the Duty Auto Adjustment direction when the adjusted
                                                     Duty reach the Up Limit or the Down Limit.                                */
      __IOM uint32_t adj_dir    : 1;            /*!< [30..30] This bit is used to set the Duty Ato Adjustment direction.
                                                     0: Decrease Duty 1: Increase Duty                                         */
      __IOM uint32_t adj_en     : 1;            /*!< [31..31] This bit is used to enable the Duty Ato Adjustment.
                                                     0: Disable 1: Enable PS. If this bit is 1, the duty of
                                                     the auto adjustment will override the duty setting in the
                                                     pwm_ctrl register.                                                        */
    } auto_adj_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t auto_adj_limit;              /*!< (@ 0x0000000C) PWM Duty Auto Adjustment Limit Register                    */
    
    struct {
      __IOM uint32_t duty_adj_dn_lim : 12;      /*!< [11..0] The down limit (in ticks) of the duty period for the
                                                     duty ratio auto adjustment                                                */
      __IM  uint32_t            : 4;
      __IOM uint32_t duty_adj_up_lim : 12;      /*!< [27..16] The up limit of the duty period for the duty ratio
                                                     auto adjustment                                                           */
    } auto_adj_limit_b;
  } ;
  
  union {
    __IOM uint32_t auto_adj_cycle;              /*!< (@ 0x00000010) PWM Duty Auto Adjustment Cycle Count Register              */
    
    struct {
      __IOM uint32_t adj_cycles : 12;           /*!< [11..0] The Cycle Count of the Duty Auto Adjustment. The Duty
                                                     size will be increased/decreased with a step size every
                                                     Cycle Count of PWM period                                                 */
    } auto_adj_cycle_b;
  } ;
} PWM0_Type;                                    /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                          LPCRAM                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Low Pin Count PSRAM controller (LPCRAM)
  */

typedef struct {                                /*!< (@ 0x40600000) LPCRAM Structure                                           */
  
  union {
    __IOM uint32_t ccr;                         /*!< (@ 0x00000000) Configuration Control Register                             */
    
    struct {
      __IOM uint32_t init       : 1;            /*!< [0..0] Start to issue PSRAM initialization sequence. Write 0
                                                     : Disable PSRAM initialization function. Write 1 : Enable
                                                     PSRAM initialization function. Read 0 : PSRAM initialization
                                                     function is still active. Read 1 : PSRAM initialization
                                                     function is done (INIT_DONE).                                             */
      __IM  uint32_t            : 2;
      __IOM uint32_t dpin       : 1;            /*!< [3..3] start to set PSRAM command function Wrtie 0 : Not to
                                                     start PSRAM DPIN function. Wrtie 1 : Start to execute DPIN
                                                     function. Read 0 : DPIN function is still active. Read
                                                     1 : DPIN function to PSRAM is done (DPIN_DONE)                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t flush_fifo : 1;            /*!< [8..8] Flush all FIFO in PSRAM_LPC_CTRL Write 0 : Not to flush
                                                     FIFO Write 1 : Start to flush FIFO Read 0 : Flushing FIFO
                                                     operation is done. Read 1 : It is sitll active to flush
                                                     FIFO.                                                                     */
      __IM  uint32_t            : 22;
      __IOM uint32_t cr_update  : 1;            /*!< [31..31] Update the internal timing control registers or Quick
                                                     INIT done.                                                                */
    } ccr_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t iocr0;                       /*!< (@ 0x00000008) IO Configuration Control Register 0                        */
    
