apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t dfi_cs_wr_dly : 4;         /*!< [3..0] Setting the latency contrast between PHY read data enable
                                                     path latency and PHY command path latency. The smallest
                                                     value is 0                                                                */
      __IOM uint32_t dfi_cs_rd_dly : 4;         /*!< [7..4] Setting the latency contrast between PHY write data path
                                                     latency and PHY command path latency. The smallest value
                                                     is 0.                                                                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t tphy_wrdata : 5;           /*!< [16..12] Setting the delay latency from DFI write command to
                                                     DFI write data. The smallest value is 1.                                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t fix_tphy_lat : 1;          /*!< [19..19] PSRAM_LPC_CTRL uses TPHY_WRDATA or TPHY_RDDATA only.
                                                     0 : Disable 1 : Enable                                                    */
      __IOM uint32_t tphy_rddata_en : 5;        /*!< [24..20] Setting the delay latency from DFI read command to
                                                     dri_rddata_en signal. The smallest value is 1.                            */
      __IOM uint32_t dfi_path_dly : 5;          /*!< [29..25] Select which TPHY_WRDATA/TPHY RDDATA cycle to sample
                                                     dfi_latency_en (dfi_latency_en_mux), the value should be
                                                     no less than 2.                                                           */
    } iocr0_b;
  } ;
  
  union {
    __IOM uint32_t csr;                         /*!< (@ 0x0000000C) Controller Status Register                                 */
    
    struct {
      __IM  uint32_t            : 8;
      __IOM uint32_t mem_idle   : 1;            /*!< [8..8] Disable memory access state. Write to set memory access
                                                     idle state. 0 : Enable memory access state. 1 : Set memory
                                                     access idel state, disable memory access. Read to check
                                                     if memory access state is in idel. 0 : Access PSRAM is
                                                     allowed. 1 : Memory state is idle and user cannot access
                                                     PSRAM through data bus.                                                   */
      __IM  uint32_t            : 8;
      __IOM uint32_t dpin_mode  : 2;            /*!< [18..17] DPIN mode decode : 00 : DPIN read data mode 01 : DPIN
                                                     write data mode 01 DPIN write data mode with iocr0[19]
                                                     for register write                                                        */
    } csr_b;
  } ;
  
  union {
    __IOM uint32_t drr;                         /*!< (@ 0x00000010) Device Refresh Power Up Register                           */
    
    struct {
      __IOM uint32_t tcph       : 4;            /*!< [3..0] PSRAM CS# pin HIGH cycles between subsequent command.              */
      __IOM uint32_t tcem       : 11;           /*!< [14..4] Maximum average refresh commands delay cycles.                    */
      __IOM uint32_t tpu        : 7;            /*!< [21..15] For PSRAM initialization flow, it has to wait this
                                                     period until the first access.                                            */
    } drr_b;
  } ;
  __IM  uint32_t  RESERVED1[4];
  
  union {
    __IOM uint32_t cmd_dpin_ndge;               /*!< (@ 0x00000024) Device Cmd Addr Pin Register (Negative Edge)               */
    
    struct {
      __IOM uint32_t addr       : 24;           /*!< [23..0] ADDR = {CA[39:32], CA[23:16], CA[7:0]}                            */
    } cmd_dpin_ndge_b;
  } ;
  
  union {
    __IOM uint32_t cmd_dpin;                    /*!< (@ 0x00000028) Device Cmd Addr Pin Register (Positive Edge)               */
    
    struct {
      __IOM uint32_t addr       : 24;           /*!< [23..0] ADDR = {CA[47:40], CA[31:24], CA[15:8]}                           */
    } cmd_dpin_b;
  } ;
  
  union {
    __IOM uint32_t cr_tdpin;                    /*!< (@ 0x0000002C) Tie DPIN Register                                          */
    
    struct {
      __IOM uint32_t dfi_reset_n : 1;           /*!< [0..0] This is tie-dpin function. Software can use this bit
                                                     to control dfi_reset_n to active or inactive. 1 : dfi_reset_n
                                                     inactive. 0 : dfi_reset_n active.                                         */
    } cr_tdpin_b;
  } ;
  
  union {
    __IOM uint32_t mr_info;                     /*!< (@ 0x00000030) Mode Latency Information Register                          */
    
    struct {
      __IOM uint32_t wl         : 5;            /*!< [4..0] Indicate PSRAM write latency counter. Refer to PSRAM
                                                     spec CR0 register altency counter field.                                  */
      __IOM uint32_t rl         : 5;            /*!< [9..5] Indicate PSRAM read latency counter. Refer to PSRAM spec
                                                     CR0 register altency counter field.                                       */
    } mr_info_b;
  } ;
  
  union {
    __IOM uint32_t mr0;                         /*!< (@ 0x00000034) Device CR0 Register                                        */
    
    struct {
      __IOM uint32_t burst_length : 2;          /*!< [1..0] Burst length per transaction. 00 : 128 bytes 01 : 64
                                                     bytes 10 : 16 bytes 11 : 32 bytes                                         */
      __IOM uint32_t burst_type : 1;            /*!< [2..2] Wrapped burst sequences in legacy wrapped burst manner             */
      __IOM uint32_t fixed_latency_en : 1;      /*!< [3..3] Latency mode control. 0 : variable initial latency, 1
                                                     or 2 times initial latency depending on RWDS during CA
                                                     cycles. 1 : fixed 2 times initial latency.                                */
      __IOM uint32_t ini_latency : 4;           /*!< [7..4] Initial Latency Count. 0000 : 5 clocks latency 0001 :
                                                     6 clocks latency 1110 : 3 clocks latency 1111 : 4 clocks
                                                     latency                                                                   */
      __IM  uint32_t            : 4;
      __IOM uint32_t drive_strength : 3;        /*!< [14..12] 000 : 50 ohms 001 : 35 ohms 010 : 100 ohms 011 : 200
                                                     ohms                                                                      */
      __IOM uint32_t deep_power_down_en : 1;    /*!< [15..15] Enable Deep Power Down mode. 0 : Enter Deep Power Down
                                                     mode. 1 : Normal operation.                                               */
    } mr0_b;
  } ;
  
  union {
    __IOM uint32_t mr1;                         /*!< (@ 0x00000038) Device CR1 Register                                        */
    
