apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t pasr       : 3;            /*!< [2..0] Partial array self refresh. 000 : full array 001 : bottom
                                                     1/2 array 010 : bottom 1/4 array 011 : bottom 1/8 array
                                                     100 : none 101 : top 1/2 array 110 : top 1/4 array 111
                                                     : top 1/8 array                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t hybrid_sleep_en : 1;       /*!< [5..5] Enter Hybird Sleep mode control. 0 : not in hybrid sleep
                                                     mode. 1 : entering hybrid sleep mode.                                     */
      __IOM uint32_t refresh_rate : 1;          /*!< [6..6] Refresh Multiplier Indicator. 0 : refresh the internal
                                                     cell array using faster rate. 1 : refresh the internal
                                                     cell array using normal rate.                                             */
    } mr1_b;
  } ;
  __IM  uint32_t  RESERVED2[9];
  
  union {
    __IOM uint32_t dpdri;                       /*!< (@ 0x00000060) DPIN Data Index Register                                   */
    
    struct {
      __IOM uint32_t dpin_data_index : 4;       /*!< [3..0] Indicate select which DPIN DATA register. Index 0~3 :
                                                     dpin read data. Index 4~7 : dpin write data. Index 8 :
                                                     dpin write data byteen.                                                   */
    } dpdri_b;
  } ;
  
  union {
    __IOM uint32_t dpdr;                        /*!< (@ 0x00000064) DPIN Data Register                                         */
    
    struct {
      __IOM uint32_t dpin_data  : 32;           /*!< [31..0] Indicate the data which will be written to PSRAM or
                                                     the data read from PSRAM.                                                 */
    } dpdr_b;
  } ;
  __IM  uint32_t  RESERVED3[35];
  
  union {
    __IM  uint32_t pctl_svn_id;                 /*!< (@ 0x000000F4) PSRAM_LPC_CTRL Version Numbers                             */
    
    struct {
      __IM  uint32_t release_date : 16;         /*!< [15..0] Indicate PSRAM Controller released date.                          */
      __IM  uint32_t git_cnt    : 16;           /*!< [31..16] Indicate the Git counter of the released date.                   */
    } pctl_svn_id_b;
  } ;
  
  union {
    __IM  uint32_t pctl_idr;                    /*!< (@ 0x000000F8) PSRAM_LPC_CTRL Identification Register                     */
    
    struct {
      __IM  uint32_t cr_pctl_def : 16;          /*!< [15..0] Main support PSRAM type.                                          */
      __IM  uint32_t cr_ver     : 16;           /*!< [31..16] The control register version number.                             */
    } pctl_idr_b;
  } ;
  __IM  uint32_t  RESERVED4[193];
  
  union {
    __IOM uint32_t user0_index;                 /*!< (@ 0x00000400) User Extended Index                                        */
    
    struct {
      __IOM uint32_t index_map_addr : 32;       /*!< [31..0] The address index of the indirect access register.                */
    } user0_index_b;
  } ;
  
  union {
    __IOM uint32_t user0_data;                  /*!< (@ 0x00000404) User Extended Data                                         */
    
    struct {
      __IOM uint32_t data_map_addr : 32;        /*!< [31..0] The data to be written to the indirect access register.           */
    } user0_data_b;
  } ;
} LPCRAM_Type;                                  /*!< Size = 1032 (0x408)                                                       */



/* =========================================================================================================================== */
/* ================                                           SPIC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SPI Controller to control 4IO & 8IO DTR Flash (SPIC)
  */

typedef struct {                                /*!< (@ 0x40020000) SPIC Structure                                             */
  
  union {
    __IOM uint32_t ctrlr0;                      /*!< (@ 0x00000000) SPIC Control Register 0                                    */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t scph       : 1;            /*!< [6..6] Serial Clock Phase.                                                */
      __IOM uint32_t scpol      : 1;            /*!< [7..7] Serial Clock Polarity.                                             */
      __IOM uint32_t tmod       : 2;            /*!< [9..8] Transfer mode.                                                     */
      __IM  uint32_t            : 6;
      __IOM uint32_t addr_ch    : 2;            /*!< [17..16] Indicate channel number of address phase in transmitting
                                                     or receiving data. Data phase is used to send data after
                                                     address phase. 0 : single channel, 1 : dual channels, 2
                                                     : quad channels, 3 : octal channel.                                       */
      __IOM uint32_t data_ch    : 2;            /*!< [19..18] Indicate channel number of data phase in transmitting
                                                     or receiving data. Data phase is used to send data after
                                                     address phase. 0 : single channel, 1 : dual channels, 2
                                                     : quad channels, 3 : octal channel.                                       */
      __IOM uint32_t cmd_ch     : 2;            /*!< [21..20] Indicate channel number of command phase in transmitting
                                                     or receiving data. Data phase is used to send data after
                                                     address phase. 0 : single channel, 1 : dual channels, 2
                                                     : quad channels, 3 : octal channel.                                       */
      __IOM uint32_t fast_rd    : 1;            /*!< [22..22] Indicate to use fast read command in user mode. If
                                                     setting to 1, SPIC would use FBAUDR to derive spi_sclk.                   */
      __IOM uint32_t ck_mtimes  : 5;            /*!< [27..23] Indicate the check time.                                         */
      __IOM uint32_t addr_ddr_en : 1;           /*!< [28..28] Enable address phase ddr mode.                                   */
      __IOM uint32_t data_ddr_en : 1;           /*!< [29..29] Enable data phase ddr mode.                                      */
      __IOM uint32_t cmd_ddr_en : 1;            /*!< [30..30] Enable command phase ddr mode. Always 2-byte command
                                                     type.                                                                     */
    } ctrlr0_b;
  } ;
  
  union {
    __IOM uint32_t ctrlr1;                      /*!< (@ 0x00000004) SPIC Control Register 1                                    */
    
