apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t ndf        : 12;           /*!< [11..0] ndf                                                               */
    } ctrlr1_b;
  } ;
  
  union {
    __IOM uint32_t ssienr;                      /*!< (@ 0x00000008) SPIC Enable Register                                       */
    
    struct {
      __IOM uint32_t spic_en    : 1;            /*!< [0..0] Enable or disable SPIC.                                            */
      __OM  uint32_t atck_cmd   : 1;            /*!< [1..1] Set to enable ATCK_CMD implementation. After this bit
                                                     is set, SPIC would not accept any command until checking
                                                     flash is not busy or timeout.                                             */
    } ssienr_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t ser;                         /*!< (@ 0x00000010) Slave Enable Register                                      */
    
    struct {
      __IOM uint32_t ser        : 1;            /*!< [0..0] SPIC only has one slave select line. This bit should
                                                     be always set.                                                            */
    } ser_b;
  } ;
  
  union {
    __IOM uint32_t baudr;                       /*!< (@ 0x00000014) Baud Rate Select Register                                  */
    
    struct {
      __IOM uint32_t sckdv      : 12;           /*!< [11..0] This register controls the frequency of spi_sclk. spi_sclk
                                                     = frequency of bus_clk / (2*sckdv)                                        */
    } baudr_b;
  } ;
  
  union {
    __IOM uint32_t txftlr;                      /*!< (@ 0x00000018) Transmit FIFO Threshold Level                              */
    
    struct {
      __IOM uint32_t tft        : 8;            /*!< [7..0] Transmit FIFO Threshold. Controls the level of entries
                                                     (or below) at which the transmit FIFO controller triggers
                                                     an interrupt.                                                             */
    } txftlr_b;
  } ;
  
  union {
    __IOM uint32_t rxftlr;                      /*!< (@ 0x0000001C) Receive FIFO Threshold Level                               */
    
    struct {
      __IOM uint32_t rft        : 8;            /*!< [7..0] Receive FIFO Threshold. Controls the level of entries
                                                     (or above) at which the receive FIFO controller triggers
                                                     an interrupt.                                                             */
    } rxftlr_b;
  } ;
  
  union {
    __IM  uint32_t txflr;                       /*!< (@ 0x00000020) Transmit FIFO Level Register                               */
    
    struct {
      __IM  uint32_t txtfl      : 8;            /*!< [7..0] Transmit FIFO Level. Contains the number of valid data
                                                     entries in the transmit FIFO.                                             */
    } txflr_b;
  } ;
  
  union {
    __IM  uint32_t rxflr;                       /*!< (@ 0x00000024) Receive FIFO Level Register                                */
    
    struct {
      __IM  uint32_t rxtfl      : 8;            /*!< [7..0] Receive FIFO Level. Contains the number of valid data
                                                     entries in the receive FIFO.                                              */
    } rxflr_b;
  } ;
  
  union {
    __IM  uint32_t sr;                          /*!< (@ 0x00000028) Status Register                                            */
    
    struct {
      __IM  uint32_t busy       : 1;            /*!< [0..0] SPIC Busy Flag. When set, indicates that a serial transfer
                                                     is in progress; when cleared indicates that the SPIC is
                                                     idle or disabled.                                                         */
      __IM  uint32_t tfnf       : 1;            /*!< [1..1] Transmit FIFO Not Full. Set when the transmit FIFO contains
                                                     one or more empty locations, and is cleared when the FIFO
                                                     is full. 0 : Transmit FIFO is full 1 : Transmit FIFO is
                                                     not full                                                                  */
      __IM  uint32_t tfe        : 1;            /*!< [2..2] Transmit FIFO Empty. When the transmit FIFO is completely
                                                     empty, this bit is set. When the transmit FIFO contains
                                                     one or more valid entries, this bit is cleared. This bit
                                                     field does not request an interrupt. 0 : Transmit FIFO
                                                     is not empty 1 : Transmit FIFO is empty                                   */
      __IM  uint32_t rfne       : 1;            /*!< [3..3] Receive FIFO Not Empty. Set when the receive FIFO contains
                                                     one or more entries and is cleared when the receive FIFO
                                                     is empty. This bit can be polled by software to completely
                                                     empty the receive FIFO. 0 : Receive FIFO is empty 1 : Receive
                                                     FIFO is not empty                                                         */
      __IM  uint32_t rff        : 1;            /*!< [4..4] Receive FIFO Full. When the receive FIFO is completely
                                                     full, this bit is set. When the receive FIFO contains one
                                                     or more empty location, this bit is cleared. 0 : Receive
                                                     FIFO is not full 1 : Receive FIFO is full                                 */
      __IM  uint32_t txe        : 1;            /*!< [5..5] Transmission Error. Set if the transmit FIFO is empty
                                                     when a transfer is started. This bit can be set only when
                                                     the DW_apb_ssi is configured as a slave device. Data from
                                                     the previous transmission is resent on the txd line. This
                                                     bit is cleared when read. 0 : No error 1 : Transmission
                                                     error                                                                     */
      __IM  uint32_t dcol       : 1;            /*!< [6..6] Transmitting Status. This bit is set when SPIC is transmitting
                                                     command, address or data to the data register. By observing
                                                     this bit, users can avoid reading wrong data at the wrong
                                                     time if data is not ready to be read.                                     */
    } sr_b;
  } ;
  
  union {
    __IOM uint32_t imr;                         /*!< (@ 0x0000002C) Interrupt Mask Register                                    */
    
