apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IM  uint32_t txeir      : 1;            /*!< [0..0] Transmit FIFO Empty Interrupt Raw Status before Masking
                                                     0 : spi_txeir_r interrupt is not acitve before masking
                                                     1 : spi_txeir_r interrupt is acitve before masking                        */
      __IM  uint32_t txoir      : 1;            /*!< [1..1] Transmit FIFO Overflow Interrupt Raw Status before Masking
                                                     0 : spi_txoir_r interrupt is not acitve before masking
                                                     1 : spi_txoir_r interrupt is acitve before masking                        */
      __IM  uint32_t rxuir      : 1;            /*!< [2..2] Receive FIFO Underflow Interrupt Raw Status before Masking
                                                     0 : spi_rxuir_r interrupt is not acitve before masking
                                                     1 : spi_rxuir_r interrupt is acitve before masking                        */
      __IM  uint32_t rxoir      : 1;            /*!< [3..3] Receive FIFO Overflow Interrupt Raw Status before Masking
                                                     0 : spi_rxoir_r interrupt is not acitve before masking
                                                     1 : spi_rxoir_r interrupt is acitve before masking                        */
      __IM  uint32_t rxfir      : 1;            /*!< [4..4] Receive FIFO Full Interrupt Raw Status before Masking
                                                     0 : spi_rxfir_r interrupt is not acitve before masking
                                                     1 : spi_rxfir_r interrupt is acitve before masking                        */
      __IM  uint32_t fseir      : 1;            /*!< [5..5] FIFO Size Error Interrupt Raw Status before Masking.
                                                     0 : spi_fseir_r interrupt is not acitve before masking
                                                     1 : spi_fseir_r interrupt is acitve before masking                        */
      __IM  uint32_t wbeir      : 1;            /*!< [6..6] Write Burst Error Interrupt Raw Status before Masking.
                                                     0 : spi_wbier_r interrupt is not acitve before masking
                                                     1 : spi_wbier_r interrupt is acitve before masking                        */
      __IM  uint32_t byeir      : 1;            /*!< [7..7] Byte Enable Error Interrupt Raw Status before Masking
                                                     0 : spi_byeir_r interrupt is not acitve before masking
                                                     1 : spi_byeir_r interrupt is acitve before masking                        */
      __IM  uint32_t aceir      : 1;            /*!< [8..8] Auto-check Timeout Error Interrupt Raw Status before
                                                     Masking. 0 : spi_aceir_r interrupt is not acitve before
                                                     masking 1 : spi_aceir_r interrupt is acitve before masking                */
    } risr_b;
  } ;
  
  union {
    __IM  uint32_t txoicr;                      /*!< (@ 0x00000038) Transmit FIFO Overflow Interrupt Clear Register            */
    
    struct {
      __IM  uint32_t txoicr     : 1;            /*!< [0..0] Clear Transmit FIFO Overflow Interrupt. This register
                                                     reflects the status of the interrupt. A read from this
                                                     register clears the ssi_txo_intr interrupt; writing has
                                                     no effect.                                                                */
    } txoicr_b;
  } ;
  
  union {
    __IM  uint32_t rxoicr;                      /*!< (@ 0x0000003C) Receive FIFO Overflow Interrupt Clear Register             */
    
    struct {
      __IM  uint32_t rxoicr     : 1;            /*!< [0..0] Clear Receive FIFO Overflow Interrupt. This register
                                                     reflects the status of the interrupt. A read from this
                                                     register clears the ssi_rxo_intr interrupt; writing has
                                                     no effect.                                                                */
    } rxoicr_b;
  } ;
  
  union {
    __IM  uint32_t rxuicr;                      /*!< (@ 0x00000040) Receive FIFO Underflow Interrupt Clear Register            */
    
    struct {
      __IM  uint32_t rxuicr     : 1;            /*!< [0..0] Clear Receive FIFO Underflow Interrupt. This register
                                                     reflects the status of the interrupt. A read from this
                                                     register clears the ssi_rxu_intr interrupt; writing has
                                                     no effect.                                                                */
    } rxuicr_b;
  } ;
  
  union {
    __IM  uint32_t faeicr;                      /*!< (@ 0x00000044) Frame Alignment Interrupt Clear Register                   */
    
    struct {
      __IM  uint32_t faeicr     : 1;            /*!< [0..0] Clear Frame Alignment Interrupt. This register reflects
                                                     the status of the interrupt. A read from this register
                                                     clears the ssi_fae_intr interrupt; writing has no effect.                 */
    } faeicr_b;
  } ;
  
  union {
    __IM  uint32_t icr;                         /*!< (@ 0x00000048) Interrupt Clear Register                                   */
    
    struct {
      __IM  uint32_t icr        : 1;            /*!< [0..0] Clear Interrupts. This register is set if any of the
                                                     interrupts below are active. A read clears the ssi_txu_intr,
                                                     ssi_txo_intr, ssi_rxu_intr, ssi_rxo_intr, and the ssi_fae_intr
                                                     interrupts. Writing to this register has no effect.                       */
    } icr_b;
  } ;
  
  union {
    __IOM uint32_t dmacr;                       /*!< (@ 0x0000004C) DMA Control Register                                       */
    
