apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t rx_dmac_en : 1;            /*!< [0..0] Receive DMA Enable. This bit enables/disables the receive
                                                     FIFO DMA channel 0 : Receive DMA disabled 1 : Receive DMA
                                                     enabled                                                                   */
      __IOM uint32_t tx_dmac_en : 1;            /*!< [1..1] Transmit DMA Enable. This bit enables/disables the transmit
                                                     FIFO DMA channel. 0 : Transmit DMA disabled 1 : Transmit
                                                     DMA enabled                                                               */
    } dmacr_b;
  } ;
  
  union {
    __IOM uint32_t dmatdlr;                     /*!< (@ 0x00000050) DMA Transmit Data Level Register                           */
    
    struct {
      __IOM uint32_t dmatdl     : 8;            /*!< [7..0] Transmit Data Level. This bit field controls the level
                                                     at which a DMA request is made by the transmit logic. It
                                                     is equal to the watermark level; that is, the dma_tx_req
                                                     signal is generated when the number of valid data entries
                                                     in the transmit FIFO is equal to or below this field value,
                                                     and tx_dmac_en = 1.                                                       */
    } dmatdlr_b;
  } ;
  
  union {
    __IOM uint32_t dmardlr;                     /*!< (@ 0x00000054) DMA Receive Data Level Register                            */
    
    struct {
      __IOM uint32_t dmardl     : 8;            /*!< [7..0] Receive Data Level. This bit field controls the level
                                                     at which a DMA request is made by the receive logic. The
                                                     watermark level = DMARDL+1; that is, dma_rx_req is generated
                                                     when the number of valid data entries in the receive FIFO
                                                     is equal to or above this field value + 1, and rx_dmac_en
                                                     = 1.                                                                      */
    } dmardlr_b;
  } ;
  __IM  uint32_t  RESERVED1[2];
  
  union {
    union {
      __IOM uint32_t dr_word;                   /*!< (@ 0x00000060) Data Register                                              */
      
      struct {
        __IOM uint32_t word     : 32;           /*!< [31..0] Access FIFO as if its width is 4 byte per data item               */
      } dr_word_b;
    } ;
    
    union {
      __IOM uint16_t dr_half_word;              /*!< (@ 0x00000060) Data Register                                              */
      
      struct {
        __IOM uint16_t half_word : 16;          /*!< [15..0] Access FIFO as if its width is 2 byte per data item               */
      } dr_half_word_b;
    } ;
    
    union {
      __IOM uint8_t dr_byte;                    /*!< (@ 0x00000060) Data Register                                              */
      
      struct {
        __IOM uint8_t byte      : 8;            /*!< [7..0] Access FIFO as if its width is 1 byte per data item                */
      } dr_byte_b;
    } ;
  };
  __IM  uint32_t  RESERVED2[31];
  
  union {
    union {
      __IOM uint32_t read_fast_single;          /*!< (@ 0x000000E0) Fast Read Command Register                                 */
      
      struct {
        __IOM uint32_t frd_cmd  : 8;            /*!< [7..0] Fast read command.                                                 */
      } read_fast_single_b;
    } ;
    
    union {
      __IOM uint32_t rd_octal_io;               /*!< (@ 0x000000E0) Fast Read Command Register                                 */
      
      struct {
        __IOM uint32_t frd_octal_cmd : 16;      /*!< [15..0] Fast read command for Octal IO mode.                              */
      } rd_octal_io_b;
    } ;
  };
  
  union {
    __IOM uint32_t read_dual_data;              /*!< (@ 0x000000E4) Dual Read Command Register                                 */
    
    struct {
      __IOM uint32_t rd_dual_o_cmd : 8;         /*!< [7..0] Dual data read command, 1-1-2 mode.                                */
    } read_dual_data_b;
  } ;
  
  union {
    __IOM uint32_t read_dual_addr_data;         /*!< (@ 0x000000E8) Dual IO Read Command Register                              */
    
    struct {
      __IOM uint32_t rd_dual_io_cmd : 8;        /*!< [7..0] Dual address and data read command, 1-2-2 mode.                    */
    } read_dual_addr_data_b;
  } ;
  
  union {
    __IOM uint32_t read_quad_data;              /*!< (@ 0x000000EC) Quad Read Command Register                                 */
    
    struct {
      __IOM uint32_t rd_quad_o_cmd : 8;         /*!< [7..0] Quad data read command, 1-1-4 mode.                                */
    } read_quad_data_b;
  } ;
  
  union {
    __IOM uint32_t read_quad_addr_data;         /*!< (@ 0x000000F0) Quad IO Read Command Register                              */
    
    struct {
      __IOM uint32_t rd_quad_io_cmd : 8;        /*!< [7..0] Quad address and data read command, 1-4-4 mode.                    */
      __IM  uint32_t            : 8;
      __IOM uint32_t prm_value  : 8;            /*!< [23..16] High Performance Read Mode Control Value.                        */
    } read_quad_addr_data_b;
  } ;
  
  union {
    union {
      __IOM uint32_t write_single;              /*!< (@ 0x000000F4) Single IO Page Program Command Register                    */
      
      struct {
        __IOM uint32_t wr_cmd   : 8;            /*!< [7..0] One bit mode page program command.                                 */
      } write_single_b;
    } ;
    
    union {
      __IOM uint32_t write_octal_io;            /*!< (@ 0x000000F4) Octal IO Page Program Command Register                     */
      
