apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
      struct {
        __IOM uint32_t rd_dummy_length : 12;    /*!< [11..0] Indicate dummy cycles for receiving data. It is referenced
                                                     by bus_clk.                                                               */
        __IOM uint32_t in_physical_cyc : 4;     /*!< [15..12] Indicate how many SPIC clk cycles from pad to internal
                                                     SPIC.                                                                     */
        __IOM uint32_t auto_addr_length : 2;    /*!< [17..16] Number of address bytes in read/write command in auto
                                                     mode                                                                      */
        __IOM uint32_t spic_cyc_per_byte : 8;   /*!< [25..18] Indicate how many SPIC clk cycles for one byte. Formula
                                                     = BAUD*2*Byte / CH, the maximum value is 256                              */
        __IOM uint32_t cs_h_rd_dum_len : 2;     /*!< [27..26] Dummy cycle between sending read command to SPI flash.
                                                     Using the dummy cycles can avoid the timing violation of
                                                     CS high time.                                                             */
        __IOM uint32_t cs_h_wr_dum_len : 4;     /*!< [31..28] Dummy cycle between sending write command to SPI flash.
                                                     Using the dummy cycles can avoid the timing violation of
                                                     CS high time.                                                             */
      } auto_length_seq_b;
    } ;
  };
  
  union {
    __IOM uint32_t valid_cmd;                   /*!< (@ 0x00000120) Valid Command Register                                     */
    
    struct {
      __IOM uint32_t frd_single : 1;            /*!< [0..0] Execute fast read for auto read mode.                              */
      __IOM uint32_t rd_dual_i  : 1;            /*!< [1..1] Execute dual data write for auto read mode. (1-1-2)                */
      __IOM uint32_t rd_dual_io : 1;            /*!< [2..2] Execute dual address data read for auto read mode. (1-2-2)         */
      __IOM uint32_t rd_quad_o  : 1;            /*!< [3..3] Execute quad data write for auto read mode. (1-1-4)                */
      __IOM uint32_t rd_quad_io : 1;            /*!< [4..4] Execute quad address data read for auto read mode. (1-4-4)         */
      __IOM uint32_t wr_dual_i  : 1;            /*!< [5..5] Execute dual data write for auto write mode. (1-1-2)               */
      __IOM uint32_t wr_dual_ii : 1;            /*!< [6..6] Execute dual address data write for auto write mode.
                                                     (1-2-2)                                                                   */
      __IOM uint32_t wr_quad_i  : 1;            /*!< [7..7] Execute quad data write for auto write mode. (1-1-4)               */
      __IOM uint32_t wr_quad_ii : 1;            /*!< [8..8] Execute quad address data write for auto write mode.
                                                     (1-4-4)                                                                   */
      __IOM uint32_t wr_blocking : 1;           /*!< [9..9] Accept next operation after the write data push to FIFO
                                                     and FIFO is pop data to empty by SPIC. Should always be
                                                     1.                                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t prm_en     : 1;            /*!< [11..11] Enable SPIC performance read mode in auto mode.                  */
      __IOM uint32_t ctrlr0_ch  : 1;            /*!< [12..12] Set this bit, then SPIC refers cmd_ch / data_ch / addr_en
                                                     / cmd_ddr_en / data_ddr_en / addr_ddr_en bit fields in
                                                     Control Register 0 in auto mode.                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t seq_trans_en : 1;          /*!< [14..14] Set 1 to enable read sequential transaction determination
                                                     function. If the auto read address is sequenctial, users
                                                     can save command phase and address phase under this mode.                 */
    } valid_cmd_b;
  } ;
  
  union {
    __IOM uint32_t flash_size;                  /*!< (@ 0x00000124) Write Enable Command Register                              */
    
    struct {
      __IOM uint32_t flash_size : 4;            /*!< [3..0] The size of flash size to select the target SPI flash
                                                     in auto mode.                                                             */
    } flash_size_b;
  } ;
  
  union {
    __IOM uint32_t flush_fifo;                  /*!< (@ 0x00000128) Read Status Command Register                               */
    
    struct {
      __OM  uint32_t flush_fifio : 1;           /*!< [0..0] Write to flush SPIC FIFO.                                          */
    } flush_fifo_b;
  } ;
} SPIC_Type;                                    /*!< Size = 300 (0x12c)                                                        */



/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UART port 0, 7/8 bit frame, 1/2 stop bit, up to 4000000 baud rate (UART0)
  */

typedef struct {                                /*!< (@ 0x40003000) UART0 Structure                                            */
  
  union {
    __IOM uint32_t dll;                         /*!< (@ 0x00000000) Divisor Latch (LS) Register                                */
    
