apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t dll        : 8;            /*!< [7..0] Baud rate divisor-low register, accessable only when
                                                     DLAB = 1                                                                  */
    } dll_b;
  } ;
  
  union {
    union {
      __IOM uint32_t dlm;                       /*!< (@ 0x00000004) Divisor Latch (MS) Register                                */
      
      struct {
        __IOM uint32_t dlm      : 8;            /*!< [7..0] Baud rate divisor-high register, accessable only when
                                                     DLAB = 1                                                                  */
      } dlm_b;
    } ;
    
    union {
      __IOM uint32_t ier;                       /*!< (@ 0x00000004) Interrupt Enable Register                                  */
      
      struct {
        __IOM uint32_t erbi     : 1;            /*!< [0..0] Enable Received Data Available Interrupt (ERBFI) (rx
                                                     trigger)                                                                  */
        __IOM uint32_t etbei    : 1;            /*!< [1..1] Enable Transmitter FIFO Empty interrupt (ETBEI) (tx fifo
                                                     empty)                                                                    */
        __IOM uint32_t elsi     : 1;            /*!< [2..2] Enable Receiver Line Status Interrupt (ELSI) (receiver
                                                     line status)                                                              */
        __IOM uint32_t edssi    : 1;            /*!< [3..3] Enable Modem Status Interrupt (EDSSI) (modem status transition)    */
      } ier_b;
    } ;
  };
  
  union {
    union {
      __IM  uint32_t iir;                       /*!< (@ 0x00000008) Interrupt Identification Register                          */
      
      struct {
        __IM  uint32_t int_pend : 1;            /*!< [0..0] Indicates that an interrupt is pending when it's logic
                                                     0. When it is 1, no interrupt is pending                                  */
        __IM  uint32_t int_id   : 3;            /*!< [3..1] Bit1 and Bit2 the two bits of the IIR are used to identify
                                                     the highest priority interrupt pending as indicated in
                                                     the following table Bit3: In the FIFO mode this bit is
                                                     set along with bit 2 when a timeout interrupt is pending.                 */
      } iir_b;
    } ;
    
    union {
      __IOM uint32_t fcr;                       /*!< (@ 0x00000008) FIFO Control Register                                      */
      
      struct {
        __OM  uint32_t en_rxfifo_err : 1;       /*!< [0..0] Set as 1 to enable the report of Error in RCVR FIFO field
                                                     in LSR bit [7]                                                            */
        __OM  uint32_t clear_rxfifo : 1;        /*!< [1..1] Writing a Logic 1 to Bit 1 clears the Receiver FIFO and
                                                     resets its logic. But it doesn't clear the shift register.
                                                     The 1 that is written to this bit position is self-clearing.              */
        __OM  uint32_t clear_txfifo : 1;        /*!< [2..2] Write 1 to this bit clears the Transmitter FIFO and resets
                                                     its logic. But the shift register is not cleared, The 1
                                                     that is written to this bit position is self-clearing.                    */
        __OM  uint32_t dma_mode : 1;            /*!< [3..3] Support DMA mode. (cooperate with DW DDMA in the data
                                                     path)                                                                     */
        __IM  uint32_t          : 1;
        __IOM uint32_t txfifo_low_level : 1;    /*!< [5..5] Define the Transmission FIFO Low Water Level Interrupt
                                                     trigger. 0: 4 byte 1: 8 bytes                                             */
        __IOM uint32_t rxfifo_trigger_level : 2;/*!< [7..6] Define the 32-entries Receiver FIFO Interrupt trigger
                                                     level 0~31 bytes 00: 1 byte 01: 8 bytes 10: 16 bytes 11:
                                                     30 bytes (for some device detect RTS de-assertion slower,
                                                     reserve more RX FIFO space to prevent RX FIFO overflow
                                                     )                                                                         */
      } fcr_b;
    } ;
  };
  
  union {
    __IOM uint32_t lcr;                         /*!< (@ 0x0000000C) Line Control Register                                      */
    
    struct {
      __IOM uint32_t wls0       : 1;            /*!< [0..0] Word length selection,                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t stb        : 1;            /*!< [2..2] This bit specifies the number of Stop bits transmitted
                                                     and received in each serial character. 0: 1 stop bit. 1:
                                                     2 stop bits. Note that the receiver always checks the first
                                                     stop bit only.                                                            */
      __IOM uint32_t parity_en  : 1;            /*!< [3..3] Parity Enable                                                      */
      __IOM uint32_t even_parity_sel : 1;       /*!< [4..4] Even Parity select                                                 */
      __IOM uint32_t stick_parity_en : 1;       /*!< [5..5] Stick Parity enable control. LCR[5:4]: 00: Odd Parity
                                                     01: Even Parity 10: Stick Parity as 0 11: Stick Parity
                                                     as 1                                                                      */
      __IOM uint32_t break_ctrl : 1;            /*!< [6..6] Break Control bit. Break control bit causes a break condition
                                                     to be transmitted to the receiving UART.                                  */
      __IOM uint32_t dlab       : 1;            /*!< [7..7] Divisor Latch Access bit Note: DLL/DLM only can be access
                                                     when dlab bit = 1, IER only can be access when dlab bit
                                                     = 0. THR/RBR don't care about dlab bit value                              */
    } lcr_b;
  } ;
  
  union {
    __IOM uint32_t mcr;                         /*!< (@ 0x00000010) Modem Control Register                                     */
    
