apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t txpulse_lowbound_shiftval : 15;/*!< [14..0] The shift value of SIR tx pulse's left edge position.         */
      __IOM uint32_t lowbound_shiftright : 1;   /*!< [15..15] SIR TX pulse lower bond shift control.                           */
      __IOM uint32_t txpulse_upperbound_shiftval : 15;/*!< [30..16] The shift value of SIR tx pulse's right edge position.     */
      __IOM uint32_t Upperbound_shiftright : 1; /*!< [31..31] SIR TX pulse upper bond shift control.                           */
    } txplsr_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t baudmonr;                    /*!< (@ 0x00000034) Baud Monitor Register                                      */
    
    struct {
      __IM  uint32_t min_fall_space : 12;       /*!< [11..0] Min_fall_space                                                    */
      __IM  uint32_t min_low_period : 12;       /*!< [23..12] Min_low_period                                                   */
      __IOM uint32_t falling_thresh : 6;        /*!< [29..24] Falling_thresh                                                   */
      __IM  uint32_t mon_data_vld : 1;          /*!< [30..30] The monitor data valid indication                                */
      __IOM uint32_t toggle_mon_en : 1;         /*!< [31..31] Baud monitor toggle bit enable.                                  */
    } baudmonr_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IM  uint32_t dbg2;                        /*!< (@ 0x0000003C) Debug Register                                             */
    
    struct {
      __IM  uint32_t dbg_uart   : 32;           /*!< [31..0] The debug port output value, depend on dbg_sel value
                                                     in SCR[2:0].                                                              */
    } dbg2_b;
  } ;
  
  union {
    __IOM uint32_t rfcr;                        /*!< (@ 0x00000040) RX Filter Control Register                                 */
    
    struct {
      __IOM uint32_t rf_len     : 1;            /*!< [0..0] Set the length of received data to be check. 0/1 = 1bytes/2bytes   */
      __IOM uint32_t rf_mask_en : 1;            /*!< [1..1] Enable the mask operation for received data.                       */
      __IOM uint32_t rf_cmp_op  : 2;            /*!< [3..2] Set the RX filter comparing rule. The matched condition
                                                     is listed as following table: RF_LEN = 0: RF_CMP_OP = 0
                                                     (AND) 1st byte = Magic Pattern1 1 (OR) (1st byte = Magic
                                                     Pattern1) OR (1st byte = Magic Pattern2) 2 (XOR) (1st byte
                                                     != Magic Pattern1) AND (1st byte != Magic Pattern2) RF_LEN
                                                     = 1: RF_CMP_OP = 0 (AND) (1st byte = Magic Pattern1) AND
                                                     (2nd byte = Magic Pattern2) 1 (OR) (2nd byte = Magic Pattern1)
                                                     OR (2nd byte = Magic Pattern2) 2 (XOR) (1st byte != Magic
                                                     Pattern1) AND (2nd byte != Magic Patte                                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t rf_en      : 1;            /*!< [7..7] RX Filter enable control                                           */
    } rfcr_b;
  } ;
  
  union {
    __IOM uint32_t rfmpr;                       /*!< (@ 0x00000044) RX Filter Magic Pattern Register                           */
    
    struct {
      __IOM uint32_t rf_mp1     : 8;            /*!< [7..0] The magic pattern1 for the 1st received byte checking.             */
      __IOM uint32_t rf_mp2     : 8;            /*!< [15..8] The magic pattern2 for the 2nd received byte checking.            */
    } rfmpr_b;
  } ;
  
  union {
    __IOM uint32_t rfmvr;                       /*!< (@ 0x00000048) RX Filter Mask Value Register                              */
    
    struct {
      __IOM uint32_t rf_mv1     : 8;            /*!< [7..0] The mask value for the 1st received byte.                          */
      __IOM uint32_t rf_mv2     : 8;            /*!< [15..8] The mask value for the 2nd received byte.                         */
    } rfmvr_b;
  } ;
  
  union {
    __IOM uint32_t rftor;                       /*!< (@ 0x0000004C) RX Filter Timeout Register                                 */
    
    struct {
      __IOM uint32_t rf_timeout : 20;           /*!< [19..0] Set the timeout value of the RX filter idle detection.
                                                     This value is number of ticks. A tick time is equal to
                                                     a UART bit time.                                                          */
    } rftor_b;
  } ;
  
  union {
    __IOM uint32_t rflvr;                       /*!< (@ 0x00000050) RX FIFO Level Register                                     */
    
    struct {
      __IM  uint32_t rx_fifo_lv : 6;            /*!< [5..0] The level of the RX FIFO. This value indicates the number
                                                     of data bytes in the RX FIFO.                                             */
    } rflvr_b;
  } ;
  
  union {
    __IOM uint32_t tflvr;                       /*!< (@ 0x00000054) TX FIFO Level Register                                     */
    
    struct {
      __IM  uint32_t tx_fifo_lv : 5;            /*!< [4..0] The level of the TX FIFO. This value indicates the number
                                                     of data bytes in the TX FIFO.                                             */
    } tflvr_b;
  } ;
  
  union {
    __IOM uint32_t visr;                        /*!< (@ 0x00000058) Vendor Interrupt Status Register                           */
    
    struct {
      __IOM uint32_t rf_match_patt : 1;         /*!< [0..0] The interrupt status of RX filter pattern checking matched.
                                                     Write 1 to clear this interrupt status. 0: Interrupt is
                                                     not pending. 1: Interrupt is pending.                                     */
      __IOM uint32_t rf_timeout : 1;            /*!< [1..1] This bit indicates the interrupt pending status of the
                                                     RX filter timeout occurred. The RX idle detection mechanism
                                                     is used to check whether the receiving is in idle state
                                                     for re-aquire pattern matching. This mechanism uses a timer
                                                     to monitor new data receiving. This timer will reload the
                                                     initial value whenever a new byte is received. If the timeout
                                                     occurred (timer value countdown to 0), the RX filter will
                                                     be reset to the initialed state and restart the first received
                                                     1 or 2 bytes checking.                                                    */
      __IOM uint32_t tx_fifo_lv : 1;            /*!< [2..2] This bit indicates the interrupt pending status of the
                                                     TX FIFO water level equal to the level setting. The software
                                                     can use this interrupt to know the TX FIFO water level
                                                     is low and refill the TX FIFO. To enable this interrupt,
                                                     IER bit[5] should be written as 1. Write 1 to this bit
                                                     will clear the pending status.                                            */
      __IOM uint32_t rx_idle_timeout : 1;       /*!< [3..3] This bit indicate the receiver idle timeout interrupt
                                                     pending status. Write 1 to this bit will clear the pending
                                                     status.                                                                   */
    } visr_b;
  } ;
  
  union {
    __IOM uint32_t vier;                        /*!< (@ 0x0000005C) Vendor Interrupt Enabling Control Register                 */
    
