apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t rf_match_int_en : 1;       /*!< [0..0] The Rx filter pattern matched interrupt enabling control:
                                                     1: enable 0: disable                                                      */
      __IOM uint32_t rf_timeout_int_en : 1;     /*!< [1..1] The Rx filter idle timeout interrupt enabling control:
                                                     1: enable 0: disable                                                      */
      __IOM uint32_t tx_fifo_lv_int_en : 1;     /*!< [2..2] The TX FIFO water level interrupt enabling control: 1:
                                                     enable 0: disable                                                         */
      __IOM uint32_t rx_idle_timeout_en : 1;    /*!< [3..3] The RX idle timeout interrupt enabling control: 1: enable
                                                     0: disable                                                                */
    } vier_b;
  } ;
  
  union {
    __IOM uint32_t ritor;                       /*!< (@ 0x00000060) RX Idle Timeout Register                                   */
    
    struct {
      __IOM uint32_t rxidle_timeout_value : 4;  /*!< [3..0] Time unit is the duration of a UART bit, depends on the
                                                     baud-rate setting. Default 0. 0: 8 bit time. (1*8) 1: 16
                                                     bit time. (2*8) 2: 32 bit time. (2^2*8) 3: 64 bit time.
                                                     (2^3*8) 4: 128 bit time. (2^4*8) 5: 256 bit time. (2^5*8)
                                                     6: 512 bit time. (2^6*8) 7: 1024 bit time. (2^7*8) 8: 2048
                                                     bit time. (2^8*8) 9: 4096 bit time. (2^9*8) 10: 8192 bit
                                                     time. (2^10*8) 11: 16384 bit time. (2^11*8) 12: 32768 bit
                                                     time. (2^12*8) 13: 65535 bit time. (2^13*8) 14: 131072
                                                     bit time. (2^14*8) 15: 262144 bit time. (2^15*8)                          */
      __IM  uint32_t            : 27;
      __IOM uint32_t rx_idle_timeout_en : 1;    /*!< [31..31] RX idle timeout enable, default 0.                               */
    } ritor_b;
  } ;
} UART0_Type;                                   /*!< Size = 100 (0x64)                                                         */



/* =========================================================================================================================== */
/* ================                                           SSI0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SSI supports 8 bit and 16 bit frame format with different combination of clock phase and clock polarity(mode 0 ~ mode 3). SSI0 is a full funtion device that can be a master or a slave device. (SSI0)
  */

typedef struct {                                /*!< (@ 0x40042000) SSI0 Structure                                             */
  
  union {
    __IOM uint32_t ctrlr0;                      /*!< (@ 0x00000000) SSI Control Register 0                                     */
    
    struct {
      __IOM uint32_t dfs        : 4;            /*!< [3..0] Data frame size                                                    */
      __IOM uint32_t frf        : 2;            /*!< [5..4] Frame format                                                       */
      __IOM uint32_t scph       : 1;            /*!< [6..6] Serial Clock Phase. Valid when the frame format (FRF)
                                                     is set to Motorola SPI. The serial clock phase selects
                                                     the relationship of the serial clock with the slave select
                                                     signal. When SCPH = 0, data are captured on the first edge
                                                     of the serial clock. When SCPH = 1, the serial clock starts
                                                     toggling one cycle after the slave select line is activated,
                                                     and data are captured on the second edge of the serial
                                                     clock. 0: Serial clock toggles in middle of first data
                                                     bit 1: Serial clock toggles at start of first data bi                     */
      __IOM uint32_t scpol      : 1;            /*!< [7..7] Serial Clock Polarity. Valid when the frame format (FRF)
                                                     is set to Motorola SPI. Used to select the polarity of
                                                     the inactive serial clock, which is held inactive when
                                                     the DW_apb_ssi master is not actively transferring data
                                                     on the serial bus. 0 : Inactive state of serial clock is
                                                     low 1 : Inactive state of serial clock is high                            */
      __IOM uint32_t tmod       : 2;            /*!< [9..8] Transfer mode                                                      */
      __IOM uint32_t slv_oe     : 1;            /*!< [10..10] Slave ouput enable. Relevant only when the device is
                                                     a slave                                                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t cfs        : 4;            /*!< [15..12] Control frame size for Microwire frame format                    */
      __IM  uint32_t            : 5;
      __IOM uint32_t tx_byte_swap : 1;          /*!< [21..21] Reverse every transmit byte                                      */
      __IOM uint32_t tx_bit_swap : 1;           /*!< [22..22] Reverse every transmit bit                                       */
      __IOM uint32_t rx_byte_swap : 1;          /*!< [23..23] Reverse every received byte                                      */
      __IOM uint32_t rx_bit_swap : 1;           /*!< [24..24] Reverse every received bit                                       */
      __IM  uint32_t            : 6;
      __IOM uint32_t ss_t       : 1;            /*!< [31..31] SSI master chooses to toggle between successive frames
                                                     or not.                                                                   */
    } ctrlr0_b;
  } ;
  
  union {
    __IOM uint32_t ctrlr1;                      /*!< (@ 0x00000004) SSI Control Register 1                                     */
    
