apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IM  uint32_t txoicr     : 1;            /*!< [0..0] Clear Transmit FIFO Overflow Interrupt. This register
                                                     reflects the status of the interrupt. A read from this
                                                     register clears the ssi_txo_intr interrupt; writing has
                                                     no effect.                                                                */
    } txoicr_b;
  } ;
  
  union {
    __IM  uint32_t rxoicr;                      /*!< (@ 0x0000003C) Receive FIFO Overflow Interrupt Clear Register             */
    
    struct {
      __IM  uint32_t rxoicr     : 1;            /*!< [0..0] Clear Receive FIFO Overflow Interrupt. This register
                                                     reflects the status of the interrupt. A read from this
                                                     register clears the ssi_rxo_intr interrupt; writing has
                                                     no effect.                                                                */
    } rxoicr_b;
  } ;
  
  union {
    __IM  uint32_t rxuicr;                      /*!< (@ 0x00000040) Receive FIFO Underflow Interrupt Clear Register            */
    
    struct {
      __IM  uint32_t rxuicr     : 1;            /*!< [0..0] Clear Receive FIFO Underflow Interrupt. This register
                                                     reflects the status of the interrupt. A read from this
                                                     register clears the ssi_rxu_intr interrupt; writing has
                                                     no effect.                                                                */
    } rxuicr_b;
  } ;
  
  union {
    __IM  uint32_t msticr;                      /*!< (@ 0x00000044) Multi-Master Interrupt Clear Register                      */
    
    struct {
      __IM  uint32_t msticr     : 1;            /*!< [0..0] Clear Multi-Master Contention Interrupt. This register
                                                     reflects the status of the interrupt. A read from this
                                                     register clears the ssi_mst_intr interrupt; writing has
                                                     no effect.                                                                */
    } msticr_b;
  } ;
  
  union {
    __IM  uint32_t icr;                         /*!< (@ 0x00000048) Interrupt Clear Register                                   */
    
    struct {
      __IM  uint32_t icr        : 1;            /*!< [0..0] Clear Interrupts. This register is set if any of the
                                                     interrupts below are active. A read clears the ssi_txu_intr,
                                                     ssi_txo_intr, ssi_rxu_intr, ssi_rxo_intr, and ssi_ssr_intr
                                                     interrupts. Writing to this register has no effect.                       */
    } icr_b;
  } ;
  
  union {
    __IOM uint32_t dmacr;                       /*!< (@ 0x0000004C) DMA Control Register                                       */
    
    struct {
      __IOM uint32_t rdmae      : 1;            /*!< [0..0] Receive DMA Enable. This bit enables/disables the receive
                                                     FIFO DMA channel 0 : Receive DMA disabled 1 : Receive DMA
                                                     enabled                                                                   */
      __IOM uint32_t tdmae      : 1;            /*!< [1..1] Transmit DMA Enable. This bit enables/disables the transmit
                                                     FIFO DMA channel. 0 : Transmit DMA disabled 1 : Transmit
                                                     DMA enabled                                                               */
    } dmacr_b;
  } ;
  
  union {
    __IOM uint32_t dmatdlr;                     /*!< (@ 0x00000050) DMA Transmit Data Level Register                           */
    
    struct {
      __IOM uint32_t dmatdl     : 8;            /*!< [7..0] Transmit Data Level. This bit field controls the level
                                                     at which a DMA request is made by the transmit logic. It
                                                     is equal to the watermark level; that is, the dma_tx_req
                                                     signal is generated when the number of valid data entries
                                                     in the transmit FIFO is equal to or below this field value,
                                                     and TDMAE = 1.                                                            */
    } dmatdlr_b;
  } ;
  
  union {
    __IOM uint32_t dmardlr;                     /*!< (@ 0x00000054) DMA Receive Data Level Register                            */
    
    struct {
      __IM  uint32_t            : 7;
      __IOM uint32_t dmardl     : 1;            /*!< [7..7] Receive Data Level. This bit field controls the level
                                                     at which a DMA request is made by the receive logic. The
                                                     watermark level = DMARDL+1; that is, dma_rx_req is generated
                                                     when the number of valid data entries in the receive FIFO
                                                     is equal to or above this field value + 1, and RDMAE=1.                   */
    } dmardlr_b;
  } ;
  
  union {
    __IM  uint32_t txuicr;                      /*!< (@ 0x00000058) Transmit FIFO Underflow Interrupt Clear Register           */
    
    struct {
      __IM  uint32_t txuicr     : 1;            /*!< [0..0] Clear Transmit FIFO Underflow Interrupt. This register
                                                     reflects the status of the interrupt. A read from this
                                                     register clears the ssi_txu_intr interrupt; writing has
                                                     no effect.                                                                */
    } txuicr_b;
  } ;
  
  union {
    __IM  uint32_t ssricr;                      /*!< (@ 0x0000005C) SS_N Rising Edge Detect Interrupt Clear Register           */
    
