apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IM  uint32_t ssiicr     : 1;            /*!< [0..0] Clear SS_N Rinsing Edge Detect Interrupt. This register
                                                     reflects the status of the interrupt. A read from this
                                                     register clears the ssi_ssr_intr interrupt; writing has
                                                     no effect.                                                                */
    } ssricr_b;
  } ;
  
  union {
    __IOM uint16_t dr;                          /*!< (@ 0x00000060) Data Register                                              */
    
    struct {
      __IOM uint16_t dr         : 16;           /*!< [15..0] Data register is a 16-bit read/write buffer for the
                                                     transmit/receive FIFOs. When the register is read, data
                                                     in the receive FIFO buffer is accessed. When it is written
                                                     to, data are moved into the transmit FIFO buffer; a write
                                                     can occur only when SSI_EN = 1. FIFOs are reset when SSI_EN
                                                     = 0.When writing to this register, you must right-justify
                                                     the data. Read data are automatically right-justified.
                                                     Read : Receive FIFO buffer Write : Transmit FIFO buffer                   */
    } dr_b;
  } ;
  __IM  uint16_t  RESERVED;
  __IM  uint32_t  RESERVED1[35];
  
  union {
    __IOM uint32_t rx_sample_dly;               /*!< (@ 0x000000F0) Rx Sample Delay Register                                   */
    
    struct {
      __IOM uint32_t rsd        : 8;            /*!< [7..0] Receive Data Sample Delay. This register is used to delay
                                                     the sample of the rxd input signal. Each value represents
                                                     a single ssi_clk delay on the sample of the rxd signal.
                                                     If this register is programmed with a value that exceed
                                                     the depth of the internal shift register, a zero delay
                                                     will be applied to the rxd sample.                                        */
    } rx_sample_dly_b;
  } ;
} SSI0_Type;                                    /*!< Size = 244 (0xf4)                                                         */



/* =========================================================================================================================== */
/* ================                                           I2C0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief I2C with 7-bit/10-bit SS/FS/HS mode in master and slave mode transmission (I2C0)
  */

typedef struct {                                /*!< (@ 0x40044000) I2C0 Structure                                             */
  
  union {
    __IOM uint32_t con;                         /*!< (@ 0x00000000) I2C Control Register                                       */
    
    struct {
      __IOM uint32_t mst_mod    : 1;            /*!< [0..0] This bit controls whether the I2C Module master is enabled.        */
      __IOM uint32_t spd        : 2;            /*!< [2..1] These bits control at which speed the I2C Module operates.         */
      __IOM uint32_t slv_10bit_addr : 1;        /*!< [3..3] When acting as a slave, this bit controls whether the
                                                     I2C Module responds to 7- or 10-bit addresses.                            */
      __IOM uint32_t mst_10bit_addr : 1;        /*!< [4..4] This bit controls whether the I2C Module starts its transfers
                                                     in 7- or 10-bit addressing mode when acting as a master.                  */
      __IOM uint32_t rstrt_en   : 1;            /*!< [5..5] This bit determines whether RESTART conditions may be
                                                     sent when acting as a master.                                             */
      __IOM uint32_t slv_dis    : 1;            /*!< [6..6] This bit controls whether I2C has its slave 0 disabled.            */
      __IOM uint32_t slv_dis_1  : 1;            /*!< [7..7] This bit controls whether I2C has its slave 1 disabled.            */
    } con_b;
  } ;
  
  union {
    __IOM uint32_t tar;                         /*!< (@ 0x00000004) I2C Target Address Register                                */
    
    struct {
      __IOM uint32_t tar        : 10;           /*!< [9..0] This is the target address for any master transaction.             */
      __IOM uint32_t gc_start_byte : 1;         /*!< [10..10] If bit 11 (SPECIAL) is set to 1, then this bit indicates
                                                     whether a General Call or START byte command is to be performed
                                                     by the I2C Module. 0: General Call 1: START BYTE                          */
      __IOM uint32_t spec       : 1;            /*!< [11..11] This bit indicates whether software performs a General
                                                     Call or START BYTE command.                                               */
      __IOM uint32_t tar_10bit_addr : 1;        /*!< [12..12] This bit controls whether the I2C Module starts its
                                                     transfers in 7-or 10-bit addressing mode when acting as
                                                     a master.                                                                 */
    } tar_b;
  } ;
  
  union {
    __IOM uint32_t sar;                         /*!< (@ 0x00000008) I2C Slave Address Register                                 */
    
