apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t sar        : 10;           /*!< [9..0] The sar holds the slave address when the I2C is operating
                                                     as a slave.                                                               */
    } sar_b;
  } ;
  
  union {
    __IOM uint32_t hs_maddr;                    /*!< (@ 0x0000000C) I2C High Speed Master Code Address Register                */
    
    struct {
      __IOM uint32_t hs_maddr   : 3;            /*!< [2..0] This bit field holds the value of the I2C HS mode master
                                                     code                                                                      */
    } hs_maddr_b;
  } ;
  
  union {
    __IOM uint32_t dat_cmd;                     /*!< (@ 0x00000010) I2C Data Buffer and Command Register                       */
    
    struct {
      __IOM uint32_t dat        : 8;            /*!< [7..0] This register contains the data to be transmitted or
                                                     received on the I2C bus.                                                  */
      __OM  uint32_t cmd        : 1;            /*!< [8..8] This bit controls whether a read or a write is performed.          */
      __OM  uint32_t stp        : 1;            /*!< [9..9] This bit controls whether a STOP is issued after the
                                                     byte is sent or received.                                                 */
      __OM  uint32_t rstrt      : 1;            /*!< [10..10] This bit controls whether a RESTART is issued before
                                                     the byte is sent or received.                                             */
      __OM  uint32_t null_dat   : 1;            /*!< [11..11] This bit controls whether to transfer slave address
                                                     only.                                                                     */
    } dat_cmd_b;
  } ;
  
  union {
    __IOM uint32_t ss_scl_hcnt;                 /*!< (@ 0x00000014) Standard Speed I2C Clock SCL High Count Register           */
    
    struct {
      __IOM uint32_t hcnt       : 16;           /*!< [15..0] This register sets the SCL clock high-period count for
                                                     standard speed.                                                           */
    } ss_scl_hcnt_b;
  } ;
  
  union {
    __IOM uint32_t ss_scl_lcnt;                 /*!< (@ 0x00000018) Standard Speed I2C Clock SCL Low Count Register            */
    
    struct {
      __IOM uint32_t lcnt       : 16;           /*!< [15..0] This register sets the SCL clock low period count for
                                                     standard speed.                                                           */
    } ss_scl_lcnt_b;
  } ;
  
  union {
    __IOM uint32_t fs_scl_hcnt;                 /*!< (@ 0x0000001C) Fast Speed I2C Clock SCL High Count Register               */
    
    struct {
      __IOM uint32_t hcnt       : 16;           /*!< [15..0] This register sets the SCL clock high-period count for
                                                     fast speed.                                                               */
    } fs_scl_hcnt_b;
  } ;
  
  union {
    __IOM uint32_t fs_scl_lcnt;                 /*!< (@ 0x00000020) Fast Speed I2C Clock SCL Low Count Register                */
    
    struct {
      __IOM uint32_t lcnt       : 16;           /*!< [15..0] This register sets the SCL clock low period count for
                                                     fast speed.                                                               */
    } fs_scl_lcnt_b;
  } ;
  
  union {
    __IOM uint32_t hs_scl_hcnt;                 /*!< (@ 0x00000024) High Speed I2C Clock SCL High Count Register               */
    
    struct {
      __IOM uint32_t hcnt       : 16;           /*!< [15..0] This register sets the SCL clock high period count for
                                                     high speed.                                                               */
    } hs_scl_hcnt_b;
  } ;
  
  union {
    __IOM uint32_t hs_scl_lcnt;                 /*!< (@ 0x00000028) High Speed I2C Clock SCL Low Count Register                */
    
    struct {
      __IOM uint32_t lcnt       : 16;           /*!< [15..0] This register sets the SCL clock low period count for
                                                     high speed.                                                               */
    } hs_scl_lcnt_b;
  } ;
  
  union {
    __IM  uint32_t intr_stat;                   /*!< (@ 0x0000002C) I2C Interrupt Status Register                              */
    
    struct {
      __IM  uint32_t rx_under   : 1;            /*!< [0..0] Set if the processor attempts to read the receive buffer
                                                     when it is empty by reading from the data_cmd register.                   */
      __IM  uint32_t rx_over    : 1;            /*!< [1..1] Set if the receive buffer is completely filled to RX_BUFFER_DEPTH
                                                     and an additional byte is received from an external I2C
                                                     device.                                                                   */
      __IM  uint32_t rx_full    : 1;            /*!< [2..2] Set when the receive buffer reaches or goes above the
                                                     rx_tl threshold in the rx_tl register                                     */
      __IM  uint32_t tx_over    : 1;            /*!< [3..3] Set during transmit if the transmit buffer is filled
                                                     to TX_BUFFER_DEPTH and the processor attempts to issue
                                                     another I2C command by writing to the DATA_CMD register.                  */
      __IM  uint32_t tx_empty   : 1;            /*!< [4..4] This bit is set to 1 when the transmit buffer is at or
                                                     below the threshold value set in the TX_TL register.                      */
      __IM  uint32_t rd_req     : 1;            /*!< [5..5] This bit is set to 1 when I2C Module is acting as a slave
                                                     and another I2C master is attempting to read data from
                                                     I2C Module.                                                               */
      __IM  uint32_t tx_abrt    : 1;            /*!< [6..6] This bit indicates if I2C Module, as an I2C transmitter,
                                                     is unable to complete the intended actions on the contents
                                                     of the transmit FIFO.                                                     */
      __IM  uint32_t rx_done    : 1;            /*!< [7..7] When the I2C Module is acting as a slave-transmitter,
                                                     this bit is set to 1 if the master does not acknowledge
                                                     a transmitted byte. This occurs on the last byte of the
                                                     transmission, indicating that the transmission is done.                   */
      __IM  uint32_t act        : 1;            /*!< [8..8] This bit captures I2C Module activity and stays set until
                                                     it is cleared. There are four ways to clear it: - Disabling
                                                     the I2C Module - Reading the CLR_ACTIVITY register - Reading
                                                     the CLR_INTR register - System reset Once this bit is set,
                                                     it stays set unless one of the four methods is used to
                                                     clear it. Even if the I2C Module module is idle, this bit
                                                     remains set until cleared, indicating that there was activity
                                                     on the bus.                                                               */
      __IM  uint32_t stp_det    : 1;            /*!< [9..9] Indicates whether a STOP condition has occurred on the
                                                     I2C interface regardless of whether I2C Module is operating
                                                     in slave or master mode.                                                  */
      __IM  uint32_t strt_det   : 1;            /*!< [10..10] Indicates whether a START or RESTART condition has
                                                     occurred on the I2C interface regardless of whether I2C
                                                     Module is operating in slave or master mode.                              */
      __IM  uint32_t gen_call   : 1;            /*!< [11..11] Set only when a General Call address is received and
                                                     it is acknowledged.                                                       */
      __IM  uint32_t addr0_match : 1;           /*!< [12..12] Indicates whether an address matches with slave address
                                                     0 when acting as a slave.                                                 */
      __IM  uint32_t addr1_match : 1;           /*!< [13..13] Indicates whether an address matches with slave address
                                                     1 when acting as a slave.                                                 */
      __IM  uint32_t ms_code_det : 1;           /*!< [14..14] Indicates whether master code is detected.                       */
      __IM  uint32_t dma_i2c_done : 1;          /*!< [15..15] Indicates whether I2C DMA operation is done.                     */
    } intr_stat_b;
  } ;
  
  union {
    __IOM uint32_t intr_msk;                    /*!< (@ 0x00000030) I2C Interrupt Mask Register                                */
    
