apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t rx_tl      : 8;            /*!< [7..0] Receive FIFO Threshold Level                                       */
    } rx_tl_b;
  } ;
  
  union {
    __IOM uint32_t tx_tl;                       /*!< (@ 0x0000003C) I2C Transmit FIFO Threshold Register                       */
    
    struct {
      __IOM uint32_t tx_tl      : 8;            /*!< [7..0] Transmit FIFO Threshold Level                                      */
    } tx_tl_b;
  } ;
  
  union {
    __IOM uint32_t clr_intr;                    /*!< (@ 0x00000040) Clear Combined and Individual Interrupt Register           */
    
    struct {
      __IM  uint32_t clr_intr   : 1;            /*!< [0..0] Read this register to clear the combined interrupt, all
                                                     individual interrupts, and the TX_ABRT_SOURCE register.                   */
    } clr_intr_b;
  } ;
  
  union {
    __IOM uint32_t clr_rx_under;                /*!< (@ 0x00000044) Clear RX_UNDER Interrupt Register                          */
    
    struct {
      __IM  uint32_t clr_rx_under : 1;          /*!< [0..0] Read this register to clear the rx_under interrupt (bit
                                                     0) of the raw_intr_stat register                                          */
    } clr_rx_under_b;
  } ;
  
  union {
    __IOM uint32_t clr_rx_over;                 /*!< (@ 0x00000048) Clear RX_OVER Interrupt Register                           */
    
    struct {
      __IM  uint32_t clr_rx_over : 1;           /*!< [0..0] Read this register to clear the rx_over interrupt (bit
                                                     1) of the raw_intr_stat register                                          */
    } clr_rx_over_b;
  } ;
  
  union {
    __IOM uint32_t clr_tx_over;                 /*!< (@ 0x0000004C) Clear TX_OVER Interrupt Register                           */
    
    struct {
      __IM  uint32_t clr_tx_over : 1;           /*!< [0..0] Read this register to clear the tx_over interrupt (bit
                                                     3) of the raw_intr_stat register.                                         */
    } clr_tx_over_b;
  } ;
  
  union {
    __IOM uint32_t clr_rd_req;                  /*!< (@ 0x00000050) Clear RD_REQ Interrupt Register                            */
    
    struct {
      __IM  uint32_t clr_rd_req : 1;            /*!< [0..0] Read this register to clear the rd_req interrupt (bit
                                                     5) of the raw_intr_stat register                                          */
    } clr_rd_req_b;
  } ;
  
  union {
    __IOM uint32_t clr_tx_abrt;                 /*!< (@ 0x00000054) Clear TX_ABRT Interrupt Register                           */
    
    struct {
      __IM  uint32_t clr_tx_abrt : 1;           /*!< [0..0] Read this register to clear the tx_abrt interrupt (bit
                                                     6) of the raw_intr_stat register, and the tx_abrt_src register.This
                                                     also releases the tx fifo from the flushed/reset state,
                                                     allowing more writes to the TX FIFO. Refer to Bit 9 of
                                                     the tx_abrt_src register for an exception to clearing tx_abrt_src.        */
    } clr_tx_abrt_b;
  } ;
  
  union {
    __IOM uint32_t clr_rx_done;                 /*!< (@ 0x00000058) Clear RX_DONE Interrupt Register                           */
    
    struct {
      __IM  uint32_t clr_rx_done : 1;           /*!< [0..0] Read this register to clear the rx_done interrupt (bit
                                                     7) of the raw_intr_stat register                                          */
    } clr_rx_done_b;
  } ;
  
  union {
    __IOM uint32_t clr_act;                     /*!< (@ 0x0000005C) Clear ACTIVITY Interrupt Register                          */
    
    struct {
      __IM  uint32_t clr_act    : 1;            /*!< [0..0] Reading this register clears the activity interrupt if
                                                     the I2C is not active anymore. If the I2C module is still
                                                     active on the bus, the activity interrupt bit continues
                                                     to be set. It is automatically cleared by hardware if the
                                                     module is disabled and if there is no further activity
                                                     on the bus. The value read from this register to get status
                                                     of the activity interrupt (bit 8) of the raw_intr_stat
                                                     register.                                                                 */
    } clr_act_b;
  } ;
  
  union {
    __IOM uint32_t clr_stp_det;                 /*!< (@ 0x00000060) Clear STOP_DET Interrupt Register                          */
    
    struct {
      __IM  uint32_t clr_stp_det : 1;           /*!< [0..0] Read this register to clear the stop_det interrupt (bit
                                                     9) of the raw_intr_stat register.                                         */
    } clr_stp_det_b;
  } ;
  
  union {
    __IOM uint32_t clr_strt_det;                /*!< (@ 0x00000064) Clear START_DET Interrupt Register                         */
    
    struct {
      __IM  uint32_t clr_strt_det : 1;          /*!< [0..0] Read this register to clear the start_det interrupt (bit
                                                     10) of the raw_intr_stat register.                                        */
    } clr_strt_det_b;
  } ;
  
  union {
    __IOM uint32_t clr_gen_call;                /*!< (@ 0x00000068) Clear GEN_CALL Interrupt Register                          */
    
    struct {
      __IM  uint32_t clr_gen_call : 1;          /*!< [0..0] Read this register to clear the gen_call interrupt (bit
                                                     11) of raw_intr_stat register                                             */
    } clr_gen_call_b;
  } ;
  
  union {
    __IOM uint32_t enable;                      /*!< (@ 0x0000006C) I2C Enable Register                                        */
    
