apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t len        : 16;           /*!< [15..0] DMA transfer data length(R/W)                                     */
      __IM  uint32_t tr_len     : 16;           /*!< [31..16] DMA mode transfer bytes(Read only)                               */
    } dma_len_b;
  } ;
  
  union {
    __IOM uint32_t dma_mod;                     /*!< (@ 0x000000A8) I2C DMA Mode Register                                      */
    
    struct {
      __IOM uint32_t dma_mod    : 2;            /*!< [1..0] DMA operation mode                                                 */
    } dma_mod_b;
  } ;
  
  union {
    __IOM uint32_t slp;                         /*!< (@ 0x000000AC) I2C Sleep Control Register                                 */
    
    struct {
      __IOM uint32_t clk_ctrl   : 1;            /*!< [0..0] I2C clock control, write 1 controller would gate I2C
                                                     clock until I2C slave is enable and reset synchronized
                                                     register procedure is done                                                */
      __IM  uint32_t slp_clk_gated : 1;         /*!< [1..1] I2C clock has been gated (Read Only)                               */
    } slp_b;
  } ;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __IOM uint32_t dat_fltr_rsts_l;             /*!< (@ 0x000000B8) Data Filter Resistor Low Register                          */
    
    struct {
      __IOM uint32_t dat_fltr_rsts_l : 20;      /*!< [19..0] Data Filter Resistor Low                                          */
    } dat_fltr_rsts_l_b;
  } ;
  
  union {
    __IOM uint32_t dat_fltr_rsts_m;             /*!< (@ 0x000000BC) Data Filter Resistor Main Register                         */
    
    struct {
      __IOM uint32_t dat_fltr_rsts_m : 20;      /*!< [19..0] Data Filter Resistor Main                                         */
    } dat_fltr_rsts_m_b;
  } ;
  
  union {
    __IOM uint32_t clk_fltr_rsts_l;             /*!< (@ 0x000000C0) Clock Filter Resistor Low Register                         */
    
    struct {
      __IOM uint32_t clk_fltr_rsts_l : 20;      /*!< [19..0] Clock Filter Resistor Low                                         */
    } clk_fltr_rsts_l_b;
  } ;
  
  union {
    __IOM uint32_t clk_fltr_rsts_m;             /*!< (@ 0x000000C4) Clock Filter Resistor Main Register                        */
    
    struct {
      __IOM uint32_t clk_fltr_rsts_m : 20;      /*!< [19..0] Clock Filter Resistor Main                                        */
    } clk_fltr_rsts_m_b;
  } ;
  
  union {
    __IOM uint32_t dat_fltr_cap_l;              /*!< (@ 0x000000C8) Data Filter Capacitor Low Register                         */
    
    struct {
      __IOM uint32_t dat_fltr_cap_l : 20;       /*!< [19..0] Data Filter Capacitor Low                                         */
    } dat_fltr_cap_l_b;
  } ;
  
  union {
    __IOM uint32_t dat_fltr_cap_m;              /*!< (@ 0x000000CC) Data Filter Capacitor Main Register                        */
    
    struct {
      __IOM uint32_t dat_fltr_cap_m : 5;        /*!< [4..0] Data Filter Capacitor Main                                         */
    } dat_fltr_cap_m_b;
  } ;
  
  union {
    __IOM uint32_t clk_fltr_cap_l;              /*!< (@ 0x000000D0) Clock Filter Capacitor Low Register                        */
    
    struct {
      __IOM uint32_t clk_fltr_cap_l : 20;       /*!< [19..0] Clock Filter Capacitor Low                                        */
    } clk_fltr_cap_l_b;
  } ;
  
  union {
    __IOM uint32_t clk_fltr_cap_m;              /*!< (@ 0x000000D4) Clock Filter Capacitor Main Register                       */
    
    struct {
      __IOM uint32_t clk_fltr_cap_m : 5;        /*!< [4..0] Clock Filter Capacitor Main                                        */
    } clk_fltr_cap_m_b;
  } ;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t clr_addr_match;              /*!< (@ 0x000000E4) Clear I2C ADDR_MATCH Interrupt Register                    */
    
    struct {
      __IOM uint32_t clr_addr_match : 1;        /*!< [0..0] Clear address match interrupts raw status, and it's read
                                                     clear.                                                                    */
    } clr_addr_match_b;
  } ;
  
  union {
    __IOM uint32_t clr_dma_done;                /*!< (@ 0x000000E8) Clear I2C DMA_DONE Interrupt Register                      */
    
    struct {
      __IOM uint32_t clr_dma_done : 1;          /*!< [0..0] Clear dma_i2c_done_intr interrupts raw status, and it's
                                                     read clear.                                                               */
    } clr_dma_done_b;
  } ;
  
  union {
    __IOM uint32_t fltr;                        /*!< (@ 0x000000EC) I2C Bus Filter Register                                    */
    
    struct {
      __IOM uint32_t dig_fltr_deg : 4;          /*!< [3..0] I2C module digital filter degree                                   */
      __IM  uint32_t            : 4;
      __IOM uint32_t dig_fltr_en : 1;           /*!< [8..8] I2C module digital filter slection (enable)                        */
    } fltr_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t sar1;                        /*!< (@ 0x000000F4) I2C Slave Address 1 Register                               */
    
    struct {
      __IOM uint32_t sar1       : 7;            /*!< [6..0] I2C Second Slave Address                                           */
    } sar1_b;
  } ;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IM  uint32_t ver;                         /*!< (@ 0x000000FC) I2C Component Version Register                             */
    
    struct {
      __IM  uint32_t ver        : 32;           /*!< [31..0] I2C module version number                                         */
    } ver_b;
  } ;
} I2C0_Type;                                    /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                         SDIO_DEV                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief SDIO Device (SDIO_DEV)
  */

typedef struct {                                /*!< (@ 0x40050000) SDIO_DEV Structure                                         */
  __IM  uint32_t  RESERVED[40];
  
  union {
    __IOM uint32_t txbd_addr;                   /*!< (@ 0x000000A0) TX BD(Buffer Descriptor) Address Register                  */
    
