apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t tx_bd_addr : 32;           /*!< [31..0] The base address of TXBD The value of this register
                                                     should be configure by CPU It should be 4 byte alignment
                                                     (Because TXBD Size is 8 Byte).                                            */
    } txbd_addr_b;
  } ;
  
  union {
    __IOM uint32_t txbd_num;                    /*!< (@ 0x000000A4) TX BD Number Register                                      */
    
    struct {
      __IOM uint32_t tx_bd_num  : 16;           /*!< [15..0] The Number of TXBD. Unit: Number The value of this register
                                                     should be configured at SDIO device HAL initialization                    */
    } txbd_num_b;
  } ;
  
  union {
    __IOM uint32_t txbd_wptr;                   /*!< (@ 0x000000A8) TX BD Write Pointer Register                               */
    
    struct {
      __IOM uint32_t tx_bd_h2c_wptr : 16;       /*!< [15..0] When the packet has been sent from Host to TX Buffer,
                                                     this index should be updated by SDIO Device HAL driver                    */
    } txbd_wptr_b;
  } ;
  
  union {
    __IOM uint32_t txbd_rptr;                   /*!< (@ 0x000000AC) TX BD Read Pointer Register                                */
    
    struct {
      __IOM uint32_t tx_bd_h2c_rptr : 16;       /*!< [15..0] When the TX packet has been processed and moved to MAC
                                                     TX FIFO, this index should be updated by HAL driver.                      */
    } txbd_rptr_b;
  } ;
  
  union {
    __IOM uint32_t rxbd_addr;                   /*!< (@ 0x000000B0) RX BD Address Register                                     */
    
    struct {
      __IOM uint32_t rx_bd_addr : 32;           /*!< [31..0] The base address of RX BD. The HAL driver should configure
                                                     this register at initial. It should be a 8-Byte aligned
                                                     address.                                                                  */
    } rxbd_addr_b;
  } ;
  
  union {
    __IOM uint16_t rxbd_num;                    /*!< (@ 0x000000B4) RX BD Number Register                                      */
    
    struct {
      __IOM uint16_t rx_bd_num  : 16;           /*!< [15..0] The total number of RX BD This register should be configured
                                                     by HAL driver at initialization.                                          */
    } rxbd_num_b;
  } ;
  
  union {
    __IOM uint16_t rxbd_wptr;                   /*!< (@ 0x000000B6) RX BD Write Pointer Register                               */
    
    struct {
      __IOM uint16_t rx_bd_c2h_wptr : 16;       /*!< [15..0] When the packet has been processed and has been moved
                                                     to host TX FIFO, this index should be updated by the HAL
                                                     driver.                                                                   */
    } rxbd_wptr_b;
  } ;
  
  union {
    __IOM uint16_t rxbd_rptr;                   /*!< (@ 0x000000B8) RX BD Read Pointer Register                                */
    
    struct {
      __IOM uint16_t rx_bd_c2h_rptr : 16;       /*!< [15..0] When the packet has been processed and has been transfered
                                                     to host, the HW will update this RX BD index.                             */
    } rxbd_rptr_b;
  } ;
  
  union {
    __IOM uint8_t hci_rx_ctrl;                  /*!< (@ 0x000000BA) HCI RX Control Register                                    */
    
    struct {
      __IOM uint8_t rx_req      : 1;            /*!< [0..0] HAL driver triggers this bit to enable SDIO IP HW to
                                                     fetch RX BD info. SDIO HW fetch RX BD to get the RX length
                                                     and address and then start to transfer RX packet to SDIO
                                                     Host. This bit will be cleared when all RX BD transfer
                                                     is done.                                                                  */
    } hci_rx_ctrl_b;
  } ;
  
  union {
    __IOM uint8_t sdio_ctrl;                    /*!< (@ 0x000000BB) SDIO HW Control Register                                   */
    
    struct {
      __IOM uint8_t sdio_dat_edge_inv : 1;      /*!< [0..0] Set this bit to invert the SDIO data latch clock.                  */
      __IM  uint8_t             : 6;
      __IOM uint8_t sdio_dma_rst : 1;           /*!< [7..7] The HAL driver can set this bit to reset SDIO DMA HW.
                                                     This bit will be cleared automatically by the HW.                         */
    } sdio_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t rx_req_addr;                 /*!< (@ 0x000000BC) RX Request Address Register                                */
    
    struct {
      __IOM uint32_t rx_req_addr : 32;          /*!< [31..0] The address of the requested RX packet. This register
                                                     is discarded for Ameba.                                                   */
    } rx_req_addr_b;
  } ;
  
  union {
    __IOM uint16_t int_mask;                    /*!< (@ 0x000000C0) Interrupt Mask Register                                    */
    
    struct {
      __IOM uint16_t txbd_h2c_ovf : 1;          /*!< [0..0] Set this bit to enable the H2C TX BD overflow interrupt.           */
      __IOM uint16_t h2c_bus_res_fail : 1;      /*!< [1..1] Set this bit to enable the H2C bus resource failed interrupt.      */
      __IOM uint16_t h2c_dma_ok : 1;            /*!< [2..2] Set this bit to enable the H2C DMA done interrupt.                 */
      __IOM uint16_t c2h_dma_ok : 1;            /*!< [3..3] Set this bit to enable the C2H DMA done interrupt.                 */
      __IOM uint16_t h2c_msg    : 1;            /*!< [4..4] Set this bit to enable the H2C message interrupt.                  */
      __IOM uint16_t rpwm1      : 1;            /*!< [5..5] Set this bit to enable the RPWM interrupt.                         */
      __IOM uint16_t rpwm2      : 1;            /*!< [6..6] Set this bit to enable the RPWM2 interrupt.                        */
      __IOM uint16_t sdio_rst_cmd : 1;          /*!< [7..7] Set this bit to enable the SDIO reset command interrupt            */
      __IOM uint16_t rx_bd_err  : 1;            /*!< [8..8] Set this bit to enable the RX BD error interrupt.                  */
      __IOM uint16_t rx_bd_avai : 1;            /*!< [9..9] Set this bit to enable the RX BD available interrupt.              */
      __IOM uint16_t host_wake  : 1;            /*!< [10..10] Set this bit to enable the SDIO host wake event interrupt.       */
      __IOM uint16_t host_cmd11 : 1;            /*!< [11..11] Set this bit to enable the SDIO host CMD11(3.3v ->
                                                     1.8v) interrupt.                                                          */
    } int_mask_b;
  } ;
  
  union {
    __IOM uint16_t int_sts;                     /*!< (@ 0x000000C2) Interrupt Status Register                                  */
    
