apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint16_t txbd_h2c_ovf : 1;          /*!< [0..0] If there is not enough TX_BD for TX Packet, this interrupt
                                                     will be raised. The HAL driver write 1 to this bit to clear
                                                     this interript status.                                                    */
      __IOM uint16_t h2c_bus_res_fail : 1;      /*!< [1..1] If SDIO is going to move packet to TX FIFO and fails
                                                     to get bus resource, this interrupt raise. HAL driver write
                                                     1 to this bit to clear this interrupt status.                             */
      __IOM uint16_t h2c_dma_ok : 1;            /*!< [2..2] Trigger by SDIO HW for the event of packet is sent from
                                                     Host to TXFIFO                                                            */
      __IOM uint16_t c2h_dma_ok : 1;            /*!< [3..3] Trigger by SDIO HW for the event of packet is sent from
                                                     RXFIFO to Host                                                            */
      __IOM uint16_t h2c_msg    : 1;            /*!< [4..4] Trigger by SDIO HW for the event of H2C_MSG_INT occurs(REG_SDIO_H2C_MSG
                                                     is written)                                                               */
      __IOM uint16_t rpwm1      : 1;            /*!< [5..5] Trigger by SDIO HW for the event of the RPWM1 occurs(HRPWM2
                                                     is written) CPU should be able to receive this interrupt
                                                     even CPU clock is gated; therefore, this interrupt should
                                                     be connected to System On circuit.                                        */
      __IOM uint16_t rpwm2      : 1;            /*!< [6..6] Trigger by SDIO HW for the event of RPWM2 occurs (HRPWM
                                                     is toggled) CPU should be able to receive this interrupt
                                                     even CPU clock is gated; therefore, this interrupt should
                                                     be connected to System On circuit.                                        */
      __IOM uint16_t sdio_rst_cmd : 1;          /*!< [7..7] Trigger by SDIO HW when SDIO is reset. CPU should be
                                                     able to receive this interrupt even CPU clock is gated;
                                                     therefore, this interrupt should be connected to System
                                                     On circuit.                                                               */
      __IOM uint16_t rx_bd_err  : 1;            /*!< [8..8] Trigger by SDIO to CPU when detect RX_BD error                     */
      __IOM uint16_t rx_bd_avai : 1;            /*!< [9..9] If the free RXBD Number become larger than FREE_RXBD_COUNT(0xD8),
                                                     trigger this interrupt. This interrupt trigger only once
                                                     when free RXBD number cross FREE_RXBD_COUNT                               */
      __IOM uint16_t host_wake  : 1;            /*!< [10..10] When Host Send TRX CMD53 while CPU is not ready (SYSTEM_CPU_RDY_IND=0
                                                     or CPU_RDY_IND=0), trigger this interrupt to wake CPU,
                                                     and then indicate BUSY status to host. CPU should be able
                                                     to receive this interrupt even CPU clock is gated; therefore,
                                                     this interrupt should be connected to System On circuit.                  */
      __IOM uint16_t host_cmd11 : 1;            /*!< [11..11] When Host sends CMD11 to notify that the signal voltage
                                                     level is going to switch to 1.8v, the HW should issue this
                                                     interrupt to notify the local CPU to do the LDO power voltage
                                                     level switch.                                                             */
    } int_sts_b;
  } ;
  
  union {
    __IOM uint8_t ccpwm;                        /*!< (@ 0x000000C4) CCPWM Register (CPU domain Sync to HCPWM register)         */
    
    struct {
      __IM  uint8_t             : 1;
      __IOM uint8_t wlan_trx    : 1;            /*!< [1..1] 1: WLAN On; 0: WLAN Off.                                           */
      __IOM uint8_t rps_st      : 1;            /*!< [2..2] 1: AP Register Active State; 0: AP Register Sleep State;           */
      __IOM uint8_t wwlan       : 1;            /*!< [3..3] 1: Wake On WLAN State; 0: Normal State;                            */
      __IM  uint8_t             : 3;
      __IOM uint8_t toggle      : 1;            /*!< [7..7] Toggling Bit: this is the one bit sequence number field.
                                                     Interrupt is issued when this bit is changed from 1 to
                                                     0 or from 0 to 1.                                                         */
    } ccpwm_b;
  } ;
  
  union {
    __IOM uint8_t sys_ind;                      /*!< (@ 0x000000C5) System Indication Register                                 */
    
    struct {
      __IOM uint8_t sys_cpu_rdy_ind : 1;        /*!< [0..0] Used to indicate the SDIO NIC driver that local CPU is
                                                     ready for TRX. Default: 0 This bit is synchronized to CPU_RDY_IND(Offset
                                                     0x87)                                                                     */
    } sys_ind_b;
  } ;
  
  union {
    __IOM uint16_t ccpwm2;                      /*!< (@ 0x000000C6) CCPWM2 Register (CPU domain Sync to HCPWM2 register)       */
    
