apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint16_t active     : 1;            /*!< [0..0] 1: indicate that the SDIO device is in the activate state.         */
      __IOM uint16_t dstandby   : 1;            /*!< [1..1] 1: indicates that the SDIO device is in the deep-standby
                                                     state.                                                                    */
      __IOM uint16_t fboot      : 1;            /*!< [2..2] 1: indicates that the SDIO device boot from the fast
                                                     boot                                                                      */
      __IOM uint16_t inic_fw_rdy : 1;           /*!< [3..3] Indicates the FW mode of the SDIO device: 1: iNIC firmware;
                                                     0: SDIO boot firmware.                                                    */
      __IM  uint16_t            : 11;
      __IOM uint16_t toggle     : 1;            /*!< [15..15] Toggling Bit: this is the one bit sequence number field.
                                                     Interrupt is issued when this bit is changed from 1 to
                                                     0 or from 0 to 1.                                                         */
    } ccpwm2_b;
  } ;
  
  union {
    __IM  uint32_t h2c_msg;                     /*!< (@ 0x000000C8) CPU H2C Message Register (CPU domain Sync from
                                                                    SDIO_H2C_MSG register)                                     */
    
    struct {
      __IM  uint32_t h2c_msg    : 31;           /*!< [30..0] The message from SDIO host side driver.                           */
      __IM  uint32_t toggle     : 1;            /*!< [31..31] Toggling Bit: this is the one bit sequence number field.
                                                     Interrupt is issued when this bit is changed from 1 to
                                                     0 or from 0 to 1.                                                         */
    } h2c_msg_b;
  } ;
  
  union {
    __IOM uint32_t c2h_msg;                     /*!< (@ 0x000000CC) CPU C2H Message Register (CPU domain Sync to
                                                                    SDIO_C2H_MSG register)                                     */
    
    struct {
      __IOM uint32_t c2h_msg    : 31;           /*!< [30..0] The message from local HAL driver to SDIO host side
                                                     driver.                                                                   */
      __IOM uint32_t toggle     : 1;            /*!< [31..31] Toggling Bit: this is the one bit sequence number field.
                                                     Interrupt is issued when this bit is changed from 1 to
                                                     0 or from 0 to 1.                                                         */
    } c2h_msg_b;
  } ;
  
  union {
    __IM  uint16_t crpwm;                       /*!< (@ 0x000000D0) CRPWM Register (SDIO host side driver to local
                                                                    HAL driver, Sync from HRPWM register)                      */
    
    struct {
      __IM  uint16_t            : 1;
      __IM  uint16_t wlan_trx   : 1;            /*!< [1..1] 1: WLAN On; 0: WLAN Off.                                           */
      __IM  uint16_t rps_st     : 1;            /*!< [2..2] 1: AP Register Active State; 0: AP Register Sleep State;           */
      __IM  uint16_t wwlan      : 1;            /*!< [3..3] 1: Wake On WLAN State; 0: Normal State;                            */
      __IM  uint16_t            : 3;
      __IM  uint16_t toggle     : 1;            /*!< [7..7] Toggling Bit: this is the one bit sequence number field.
                                                     Interrupt is issued when this bit is changed from 1 to
                                                     0 or from 0 to 1.                                                         */
    } crpwm_b;
  } ;
  
  union {
    __IM  uint16_t crpwm2;                      /*!< (@ 0x000000D2) CRPWM2 Register (SDIO host side driver to local
                                                                    HAL driver, Sync from HRPWM register)                      */
    
    struct {
      __IM  uint16_t resv       : 15;           /*!< [14..0] Reserved                                                          */
      __IM  uint16_t toggle     : 1;            /*!< [15..15] Toggling Bit: this is the one bit sequence number field.
                                                     Interrupt is issued when this bit is changed from 1 to
                                                     0 or from 0 to 1.                                                         */
    } crpwm2_b;
  } ;
  
  union {
    __IOM uint32_t ahb_dma_ctrl;                /*!< (@ 0x000000D4) AHB DMA Control Register                                   */
    
    struct {
      __IOM uint32_t spdio_txff_wlevel : 7;     /*!< [6..0] SPDIO FIFO TX water level Range 1~126, it can be modified
                                                     only when AHB_DMA_CS = 000                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t spdio_rxff_wlevel : 7;     /*!< [14..8] SPDIO FIFO RX water level Range 1~126, it can be modified
                                                     only when AHB_DMA_CS = 000                                                */
      __IM  uint32_t            : 1;
      __IM  uint32_t ahb_dma_state : 4;         /*!< [19..16] AHB DMA state                                                    */
      __IM  uint32_t            : 1;
      __IM  uint32_t ahbm_spdio_ready : 1;      /*!< [21..21] SPDIO AHB Master HREADY signal                                   */
      __IM  uint32_t ahbm_spdio_trans : 2;      /*!< [23..22] SPDIO AHB Master HTRANS signal                                   */
      __IOM uint32_t rx_ahb_busy_wait_cnt : 4;  /*!< [27..24] When SPDIO RX transfer, AHB controller will wait BUSY
                                                     counter for AHB access target not response READY signal.
                                                     If timeout, AHB controller will issue AHB_BUS_RES_FAIL
                                                     INT to CPU.                                                               */
      __IOM uint32_t ahb_burst_type : 3;        /*!< [30..28] This field is used to control to SPDIO AHB support
                                                     Burst type. 3'b100: Support Burst 16 DW 3'b010: Support
                                                     Burst 8 DW 3'b001: Support Burst 4 DW Default is 3'b111,
                                                     all support.                                                              */
      __IOM uint32_t dispatch_txagg_pkt : 1;    /*!< [31..31] Enable SPDIO to dispatch the Aggregated TX packet.               */
    } ahb_dma_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t free_rxbd_cnt;               /*!< (@ 0x000000D8) Free RX BD Count Register                                  */
    
