apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t fifo_cnt   : 7;            /*!< [6..0] The SPDIO Local FIFO counter, for debug usage.                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t tx_buf_unit_size : 8;      /*!< [15..8] The Size of each single TX Buffer which is addressed
                                                     by TX_BD Unit: 64Byte Ex: 0x01=>64Byte 0x10=>1024Byte                     */
      __IOM uint32_t free_rx_bd_cnt : 16;       /*!< [31..16] If SPDIO_RXBD_C2H_RPTR is updated and the free RXBD
                                                     Number is larger than FREE_RXBD_COUNT, trigger RX_BD_AVAI_INT
                                                     interrupt.                                                                */
    } free_rxbd_cnt_b;
  } ;
  
  union {
    __IM  uint32_t h2c_msg_ext;                 /*!< (@ 0x000000DC) CPU H2C Extension Message Register (CPU domain
                                                                    Sync from SDIO_H2C_MSG_EXT register)                       */
    
    struct {
      __IM  uint32_t h2c_msg_ext : 31;          /*!< [30..0] The message from SDIO host side driver to the local
                                                     HAL driver.                                                               */
      __IM  uint32_t toggle     : 1;            /*!< [31..31] Toggling Bit: this is the one bit sequence number field.
                                                     Interrupt is issued when this bit is changed from 1 to
                                                     0 or from 0 to 1.                                                         */
    } h2c_msg_ext_b;
  } ;
  
  union {
    __IOM uint32_t c2h_msg_ext;                 /*!< (@ 0x000000E0) CPU C2H Extension Message Register (CPU domain
                                                                    Sync to SDIO_C2H_MSG_EXT register)                         */
    
    struct {
      __IOM uint32_t c2h_msg_ext : 31;          /*!< [30..0] The message from local HAL driver to SDIO host side
                                                     driver.                                                                   */
      __IOM uint32_t toggle     : 1;            /*!< [31..31] Toggling Bit: this is the one bit sequence number field.
                                                     Interrupt is issued when this bit is changed from 1 to
                                                     0 or from 0 to 1.                                                         */
    } c2h_msg_ext_b;
  } ;
} SDIO_DEV_Type;                                /*!< Size = 228 (0xe4)                                                         */



/* =========================================================================================================================== */
/* ================                                           GDMA0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief GDMA IP in low power platform with AXI interface. Only support up to 4092 data items. Common register struct for all channels (GDMA0)
  */

typedef struct {                                /*!< (@ 0x400602C0) GDMA0 Structure                                            */
  
  union {
    __IM  uint32_t raw_tfr;                     /*!< (@ 0x00000000) IntTfr Raw Interrupt Status Register                       */
    
    struct {
      __IM  uint32_t raw_tfr    : 6;            /*!< [5..0] Raw interrupt status of transfer complete                          */
    } raw_tfr_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IM  uint32_t raw_block;                   /*!< (@ 0x00000008) IntBlock Raw Interrupt Status Register                     */
    
    struct {
      __IM  uint32_t raw_block  : 6;            /*!< [5..0] Raw interrupt status of one block transfer complete                */
    } raw_block_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IM  uint32_t raw_src_tran;                /*!< (@ 0x00000010) IntSrcTran Raw Interrupt Status Register                   */
    
    struct {
      __IM  uint32_t raw_src_tran : 6;          /*!< [5..0] Raw interrupt status of source transfer complete                   */
    } raw_src_tran_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IM  uint32_t raw_dst_tran;                /*!< (@ 0x00000018) IntDstTran Raw Interrupt Status Register                   */
    
    struct {
      __IM  uint32_t raw_dst_tran : 6;          /*!< [5..0] Raw interrupt status of destination transfer complete              */
    } raw_dst_tran_b;
  } ;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IM  uint32_t raw_err;                     /*!< (@ 0x00000020) IntErr Raw Interrupt Status Register                       */
    
    struct {
      __IM  uint32_t raw_err    : 6;            /*!< [5..0] Raw interrupt status of transfer error                             */
    } raw_err_b;
  } ;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IM  uint32_t status_tfr;                  /*!< (@ 0x00000028) IntTfr Interrupt Status Register                           */
    
    struct {
      __IM  uint32_t status_tfr : 6;            /*!< [5..0] Interrupt status of transfer complete                              */
    } status_tfr_b;
  } ;
  __IM  uint32_t  RESERVED5;
  
  union {
    __IM  uint32_t status_block;                /*!< (@ 0x00000030) IntBlock Interrupt Status Register                         */
    
    struct {
      __IM  uint32_t status_block : 6;          /*!< [5..0] Interrupt status of one block transfer complete                    */
    } status_block_b;
  } ;
  __IM  uint32_t  RESERVED6;
  
  union {
    __IM  uint32_t status_src_tran;             /*!< (@ 0x00000038) IntSrcTran Interrupt Status Register                       */
    
    struct {
      __IM  uint32_t status_src_tran : 6;       /*!< [5..0] Interrupt status of source transfer complete                       */
    } status_src_tran_b;
  } ;
  __IM  uint32_t  RESERVED7;
  
  union {
    __IM  uint32_t status_dst_tran;             /*!< (@ 0x00000040) IntDstTran Interrupt Status Register                       */
    
