apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IM  uint32_t status_dst_tran : 6;       /*!< [5..0] Interrupt status of destination transfer complete                  */
    } status_dst_tran_b;
  } ;
  __IM  uint32_t  RESERVED8;
  
  union {
    __IM  uint32_t status_err;                  /*!< (@ 0x00000048) IntErr Interrupt Status Register                           */
    
    struct {
      __IM  uint32_t status_err : 6;            /*!< [5..0] Interrupt status of transfer error                                 */
    } status_err_b;
  } ;
  __IM  uint32_t  RESERVED9;
  
  union {
    __IOM uint32_t mask_tfr;                    /*!< (@ 0x00000050) IntTfr Interrupt Mask Register                             */
    
    struct {
      __IOM uint32_t mask_tfr   : 6;            /*!< [5..0] Interrupt mask of transfer complete                                */
    } mask_tfr_b;
  } ;
  __IM  uint32_t  RESERVED10;
  
  union {
    __IOM uint32_t mask_block;                  /*!< (@ 0x00000058) IntBlock Interrupt Mask Register                           */
    
    struct {
      __IOM uint32_t mask_block : 6;            /*!< [5..0] Interrupt mask of one block transfer complete                      */
    } mask_block_b;
  } ;
  __IM  uint32_t  RESERVED11;
  
  union {
    __IOM uint32_t mask_src_tran;               /*!< (@ 0x00000060) IntSrcTran Interrupt Mask Register                         */
    
    struct {
      __IOM uint32_t mask_src_tran : 6;         /*!< [5..0] Interrupt mask of source transfer complete                         */
    } mask_src_tran_b;
  } ;
  __IM  uint32_t  RESERVED12;
  
  union {
    __IOM uint32_t mask_dst_tran;               /*!< (@ 0x00000068) IntDstTran Interrupt Mask Register                         */
    
    struct {
      __IOM uint32_t mask_dst_tran : 6;         /*!< [5..0] Interrupt mask of destination transfer complete                    */
    } mask_dst_tran_b;
  } ;
  __IM  uint32_t  RESERVED13;
  
  union {
    __IOM uint32_t mask_err;                    /*!< (@ 0x00000070) IntErr Interrupt Mask Register                             */
    
    struct {
      __IOM uint32_t mask_err   : 6;            /*!< [5..0] Interrupt mask of transfer error                                   */
    } mask_err_b;
  } ;
  __IM  uint32_t  RESERVED14;
  
  union {
    __IOM uint32_t clear_tfr;                   /*!< (@ 0x00000078) IntTfr Interrupt Clear Register                            */
    
    struct {
      __OM  uint32_t status_tfr : 6;            /*!< [5..0] Clear interrupt status of transfer complete                        */
    } clear_tfr_b;
  } ;
  __IM  uint32_t  RESERVED15;
  
  union {
    __IOM uint32_t clear_block;                 /*!< (@ 0x00000080) IntBlock Interrupt Clear Register                          */
    
    struct {
      __OM  uint32_t clear_block : 6;           /*!< [5..0] Clear interrupt status of one block transfer complete              */
    } clear_block_b;
  } ;
  __IM  uint32_t  RESERVED16;
  
  union {
    __IOM uint32_t clear_src_tran;              /*!< (@ 0x00000088) IntSrcTran Interrupt Clear Register                        */
    
    struct {
      __OM  uint32_t clear_src_tran : 6;        /*!< [5..0] Clear interrupt status of source transfer complete                 */
    } clear_src_tran_b;
  } ;
  __IM  uint32_t  RESERVED17;
  
  union {
    __IOM uint32_t clear_dst_tran;              /*!< (@ 0x00000090) IntDstTran Interrupt Clear Register                        */
    
    struct {
      __OM  uint32_t clear_dst_tran : 6;        /*!< [5..0] Clear interrupt status of destination transfer complete            */
    } clear_dst_tran_b;
  } ;
  __IM  uint32_t  RESERVED18;
  
  union {
    __IOM uint32_t clear_err;                   /*!< (@ 0x00000098) IntErr Interrupt Clear Register                            */
    
    struct {
      __OM  uint32_t clear_err  : 6;            /*!< [5..0] Clear interrupt status of transfer error                           */
    } clear_err_b;
  } ;
  __IM  uint32_t  RESERVED19;
  
  union {
    __IM  uint32_t status_int;                  /*!< (@ 0x000000A0) Combined Interrupt Status Register                         */
    
    struct {
      __IM  uint32_t tfr        : 1;            /*!< [0..0] OR of the contents of StatusTfr register                           */
      __IM  uint32_t block      : 1;            /*!< [1..1] OR of the contents of StatusBlock register                         */
      __IM  uint32_t srct       : 1;            /*!< [2..2] OR of the contents of StatusSrcTran register                       */
      __IM  uint32_t dstt       : 1;            /*!< [3..3] OR of the contents of StatusDstTran register                       */
      __IM  uint32_t err        : 1;            /*!< [4..4] OR of the contents of StatusErr register                           */
    } status_int_b;
  } ;
  __IM  uint32_t  RESERVED20[13];
  
  union {
    __IOM uint32_t dma_cfg_reg;                 /*!< (@ 0x000000D8) Configuration Register                                     */
    
    struct {
      __IOM uint32_t dma_en     : 1;            /*!< [0..0] RTK_DMAC Enable bit. 0 : Disable, 1 : Enable                       */
    } dma_cfg_reg_b;
  } ;
  __IM  uint32_t  RESERVED21;
  
  union {
    __IOM uint32_t ch_en_reg;                   /*!< (@ 0x000000E0) Channel Enable Register                                    */
    
    struct {
      __IOM uint32_t ch_en      : 6;            /*!< [5..0] Enables/Disables the channel. Setting this bit enables
                                                     a channel while clearing this bit disables the channel.
                                                     0 : Disable the Channel 1 : Enable the Channel The ChEnReg.CH_EN
                                                     bit is automatically cleared by hardware to disable the
                                                     channel after the last AXI transfer of the DMA transfer
                                                     to the destination has completed. Software can therefore
                                                     poll this bit to determine when this channel is free for
                                                     a new DMA transfer.                                                       */
      __IM  uint32_t            : 2;
      __OM  uint32_t ch_en_we   : 6;            /*!< [13..8] Channel enable write enable                                       */
    } ch_en_reg_b;
  } ;
  __IM  uint32_t  RESERVED22[5];
  
  union {
    __IOM uint32_t ch_reset_reg;                /*!< (@ 0x000000F8) Channel Reset Register                                     */
    
