apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t ch_reset_en : 6;           /*!< [5..0] Reset channel enable. Set this bit to reset a channel;
                                                     clear this bit to finish the reset flow and release the
                                                     channel. 0 : reset the channel finish 1 : reset the channel
                                                     start The reset bit is not automatically cleared by hardware.
                                                     Software must clear it to finish software reset.                          */
      __IM  uint32_t            : 2;
      __IM  uint32_t ch_reset_en_we : 6;        /*!< [13..8] Channel reset write enable                                        */
    } ch_reset_reg_b;
  } ;
} GDMA0_Type;                                   /*!< Size = 252 (0xfc)                                                         */



/* =========================================================================================================================== */
/* ================                                         GDMA0_CH0                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief GDMA control registers for specific channels (GDMA0_CH0)
  */

typedef struct {                                /*!< (@ 0x40060000) GDMA0_CH0 Structure                                        */
  
  union {
    __IOM uint32_t sar;                         /*!< (@ 0x00000000) Source Address Register for Channel x                      */
    
    struct {
      __IOM uint32_t sar        : 32;           /*!< [31..0] Source Address of DMA transfer. Updated after each source
                                                     transfer. The SINC field in the CTLx register determines
                                                     whether the address increments, decrements, or is left
                                                     unchanged on every source transfer throughout the block
                                                     transfer.                                                                 */
    } sar_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t dar;                         /*!< (@ 0x00000008) Destination Address Register for Channel x                 */
    
    struct {
      __IOM uint32_t dar        : 32;           /*!< [31..0] Destination address of DMA transfer. Updated after each
                                                     destination transfer. The DINC field in the CTLx register
                                                     determines whether the address increments, decrements,
                                                     or is left unchanged on every destination transfer throughout
                                                     the block transfer                                                        */
    } dar_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t llp;                         /*!< (@ 0x00000010) Linked List Pointer Register for Channel x                 */
    
    struct {
      __IOM uint32_t lms        : 2;            /*!< [1..0] List Master Select. Identifies the AHB layer/interface
                                                     where the memory device that stores the next linked list
                                                     item resides.                                                             */
      __IOM uint32_t loc        : 30;           /*!< [31..2] Starting address in memory of next LLI if block chaining
                                                     is enabled.                                                               */
    } llp_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t ctl_low;                     /*!< (@ 0x00000018) Lower Word of Control Register for Channel x               */
    
    struct {
      __IOM uint32_t int_en     : 1;            /*!< [0..0] If set, then all interrupt-generating sources are enabled.
                                                     Functions as a global mask bit for all interrupts for the
                                                     channel. Raw interrupt registers still assert if this field
                                                     is 0.                                                                     */
      __IOM uint32_t dst_tr_width : 3;          /*!< [3..1] Destination Transfer Width. 0x000 : 8 bit, 0x001 : 16
                                                     bit, 0x010 : 32 bit                                                       */
      __IOM uint32_t src_tr_width : 3;          /*!< [6..4] Source Transfer Width. The block_ts field should be modified
                                                     in accordance with this field. 0x000 : 8 bit, 0x001 : 16
                                                     bit, 0x010 : 32 bit                                                       */
      __IOM uint32_t dinc       : 2;            /*!< [8..7] Destination Address Increment. Indicate whether to increment
                                                     to destination address on every destination transfer. If
                                                     the device is fetching data from a destination peripheral
                                                     FIFO with a fixed adress, then this field should be set
                                                     to No Change. 0x00 : Increment, 0x1x : NoChange.                          */
      __IOM uint32_t sinc       : 2;            /*!< [10..9] Source Address Increment. Indicate whether to increment
                                                     to source address on every source transfer. If the device
                                                     is fetching data from a source peripheral FIFO with a fixed
                                                     adress, then this field should be set to No Change. 0x00
                                                     : Increment, 0x1x : NoChange.                                             */
      __IOM uint32_t dest_msize : 3;            /*!< [13..11] Destination Burst Transaction Length. Number of data
                                                     items, each of width ctl.dst_tr_width, to be read from
                                                     the destination every time a destination burst transaction
                                                     request is mode.                                                          */
      __IOM uint32_t src_msize  : 3;            /*!< [16..14] Source Burst Transaction Length. Number of data items,
                                                     each of width ctl.src_tr_width, to be read from the source
                                                     every time a source burst transaction request is mode.                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t tt_fc      : 3;            /*!< [22..20] Transfer Type and Flow Control. The following transfer
                                                     types are supported. Memory to Memory, Memory to Peripheral,
                                                     Peripheral to Memory.                                                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t llp_dst_en : 1;            /*!< [27..27] Block chaining is enabled on the destination side if
                                                     this field is high and llp.loc is non-zero.                               */
      __IOM uint32_t llp_src_en : 1;            /*!< [28..28] Block chaining is enabled on the source side if this
                                                     field is high and llp.loc is non-zero.                                    */
    } ctl_low_b;
  } ;
  
  union {
    __IOM uint32_t ctl_up;                      /*!< (@ 0x0000001C) Upper Word of Control Register for Channel x               */
    
