apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
    struct {
      __IOM uint32_t block_ts   : 12;           /*!< [11..0] Block Transfer Size. When the RTK_DMAC is the flow controller,
                                                     the user writes this field before the channel is enabled
                                                     in order to indicate the block size. The block_ts should
                                                     be modified according to the src_tr_width field. Ex: If
                                                     src_tr_width = 4 byte, block_ts = 2.                                      */
    } ctl_up_b;
  } ;
  __IM  uint32_t  RESERVED3[8];
  
  union {
    __IOM uint32_t cfg_low;                     /*!< (@ 0x00000040) Lower Word of Configuration Register for Channel
                                                                    x                                                          */
    
    struct {
      __IOM uint32_t inactive   : 1;            /*!< [0..0] Indicate the channel is inactive or not. 1: Inactive
                                                     state, 0: Active state.                                                   */
      __IM  uint32_t            : 7;
      __IOM uint32_t ch_susp    : 1;            /*!< [8..8] Channel Suspend. Suspends all DMA data transfers from
                                                     the source until this bit is cleared. There is no guarantee
                                                     that the current transaction will complete. Can also be
                                                     used in conjunction with CFGx.FIFO_EMPTY to cleanly disable
                                                     a channel without losing any data. 0 : Not suspended, 1
                                                     : Suspend DMA transfer from the source                                    */
      __IM  uint32_t fifo_empty : 1;            /*!< [9..9] Indicates if there is data left in the channel FIFO.
                                                     Can be used in conjunction with CFGx.CH_SUSP to cleanly
                                                     disable a channel. 1 : Channel FIFO empty, 0 : Channel
                                                     FIFO not empty.                                                           */
      __IM  uint32_t            : 8;
      __IOM uint32_t dst_hs_pol : 1;            /*!< [18..18] Destination Handshaking Interface Polarity. 0 : Active
                                                     high, 1: Active low                                                       */
      __IOM uint32_t src_hs_pol : 1;            /*!< [19..19] Source Handshaking Interface Polarity. 0 : Active high,
                                                     1: Active low                                                             */
      __IOM uint32_t max_abrst  : 10;           /*!< [29..20] Maximum OCP Burst Length. Maximum OCP burst length
                                                     that is used for DMA transfers on this channel.                           */
      __IOM uint32_t reload_src : 1;            /*!< [30..30] Automatic Source Reload. The SAR register can be automatically
                                                     reloaded from its initial value at the end of every block
                                                     for multi-block transfers. Not support in LP-GDMA.                        */
      __IOM uint32_t reload_dst : 1;            /*!< [31..31] Automatic Destination Reload. The DAR register can
                                                     be automatically reloaded from its initial value at the
                                                     end of every block for multi-block transfers. Not support
                                                     in LP-GDMA.                                                               */
    } cfg_low_b;
  } ;
  
  union {
    __IOM uint32_t cfg_up;                      /*!< (@ 0x00000044) Upper Word of Configuration Register for Channel
                                                                    x                                                          */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t fifo_mode  : 1;            /*!< [1..1] FIFO Mode Select. Determines how much space or data needs
                                                     to be available in the FIFO before a burst transaction
                                                     request is servied. Enable this field will improve OCP/AXI
                                                     master interface burst transaction length, but the burst
                                                     transaction length also controlled by CTL.SRC_MSIZE and
                                                     CTL.DST_MSIZE. If FIFO_MODE is enabled, the maximal burst
                                                     transaction length is the minimum value of FIFO depth(half
                                                     FIFO depth) and MSIZE. If FIFO_MODE is disabled, the burst
                                                     transaction length will be fixed to 1. It is recom                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t secure_en  : 1;            /*!< [3..3] Enable secure mode DMA transfer. This bit can only be
                                                     accessed by CPU under secure mode. Non-secure GDMA does
                                                     not have this bit.                                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t src_per    : 4;            /*!< [10..7] Assigns a hardware handshaking interface to the source
                                                     of channels. The channel can then communicate with the
                                                     source peripheral connected to that interface through the
                                                     assigned hardware handshaking interface.                                  */
      __IOM uint32_t dest_per   : 4;            /*!< [14..11] Assigns a hardware handshaking interface to the destination
                                                     of channels. The channel can then communicate with the
                                                     destination peripheral connected to that interface through
                                                     the assigned hardware handshaking interface.                              */
      __IOM uint32_t extended_src_per : 1;      /*!< [15..15] The extened 4th bit of src_per when hardware handshake
                                                     interfaces number is configured to 32. Not supported in
                                                     LP-GDMA.                                                                  */
      __IOM uint32_t extended_dest_per : 1;     /*!< [16..16] The extened 4th bit of dest_per when hardware handshake
                                                     interfaces number is configured to 32. Not supported in
                                                     LP-GDMA.                                                                  */
    } cfg_up_b;
  } ;
} GDMA0_CH0_Type;                               /*!< Size = 72 (0x48)                                                          */


