apache/nuttx/arch/arm/src/rtl8720c/8710c/cmsis/rtl8710c/include/rtl8710c.h
/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define MiscIRQ_BASE                0x00000000UL
#define GPIO_BASE                   0x40001000UL
#define TG0_BASE                    0x40003800UL
#define TM0_BASE                    0x40002040UL
#define TM1_BASE                    0x40002080UL
#define TM2_BASE                    0x400020C0UL
#define TM3_BASE                    0x40002100UL
#define TM4_BASE                    0x40002140UL
#define TM5_BASE                    0x40002180UL
#define TM6_BASE                    0x400021C0UL
#define TM7_BASE                    0x40002200UL
#define TG1_BASE                    0x40002000UL
#define TM8_BASE                    0x40003840UL
#define PWM_COMM_BASE               0x40001C00UL
#define PWM0_BASE                   0x40001C20UL
#define PWM1_BASE                   0x40001C40UL
#define PWM2_BASE                   0x40001C60UL
#define PWM3_BASE                   0x40001C80UL
#define PWM4_BASE                   0x40001CA0UL
#define PWM5_BASE                   0x40001CC0UL
#define PWM6_BASE                   0x40001CE0UL
#define PWM7_BASE                   0x40001D00UL
#define LPCRAM_BASE                 0x40600000UL
#define SPIC_BASE                   0x40020000UL
#define UART0_BASE                  0x40003000UL
#define UART1_BASE                  0x40040000UL
#define UART2_BASE                  0x40040400UL
#define UART3_BASE                  0x40040800UL
#define SSI0_BASE                   0x40042000UL
#define I2C0_BASE                   0x40044000UL
#define SDIO_DEV_BASE               0x40050000UL
#define GDMA0_BASE                  0x400602C0UL
#define GDMA0_CH0_BASE              0x40060000UL
#define GDMA0_CH1_BASE              0x40060058UL
#define SGDMA0_BASE                 0x500602C0UL
#define SGDMA0_CH0_BASE             0x50060000UL
#define SGDMA0_CH1_BASE             0x50060058UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define MiscIRQ                     ((MiscIRQ_Type*)           MiscIRQ_BASE)
#define GPIO                        ((GPIO_Type*)              GPIO_BASE)
#define TG0                         ((TG0_Type*)               TG0_BASE)
#define TM0                         ((TM0_Type*)               TM0_BASE)
#define TM1                         ((TM0_Type*)               TM1_BASE)
#define TM2                         ((TM0_Type*)               TM2_BASE)
#define TM3                         ((TM0_Type*)               TM3_BASE)
#define TM4                         ((TM0_Type*)               TM4_BASE)
#define TM5                         ((TM0_Type*)               TM5_BASE)
#define TM6                         ((TM0_Type*)               TM6_BASE)
#define TM7                         ((TM0_Type*)               TM7_BASE)
#define TG1                         ((TG0_Type*)               TG1_BASE)
#define TM8                         ((TM0_Type*)               TM8_BASE)
#define PWM_COMM                    ((PWM_COMM_Type*)          PWM_COMM_BASE)
#define PWM0                        ((PWM0_Type*)              PWM0_BASE)
#define PWM1                        ((PWM0_Type*)              PWM1_BASE)
#define PWM2                        ((PWM0_Type*)              PWM2_BASE)
#define PWM3                        ((PWM0_Type*)              PWM3_BASE)
#define PWM4                        ((PWM0_Type*)              PWM4_BASE)
#define PWM5                        ((PWM0_Type*)              PWM5_BASE)
#define PWM6                        ((PWM0_Type*)              PWM6_BASE)
#define PWM7                        ((PWM0_Type*)              PWM7_BASE)
#define LPCRAM                      ((LPCRAM_Type*)            LPCRAM_BASE)
#define SPIC                        ((SPIC_Type*)              SPIC_BASE)
#define UART0                       ((UART0_Type*)             UART0_BASE)
#define UART1                       ((UART0_Type*)             UART1_BASE)
#define UART2                       ((UART0_Type*)             UART2_BASE)
#define UART3                       ((UART0_Type*)             UART3_BASE)
#define SSI0                        ((SSI0_Type*)              SSI0_BASE)
#define I2C0                        ((I2C0_Type*)              I2C0_BASE)
#define SDIO_DEV                    ((SDIO_DEV_Type*)          SDIO_DEV_BASE)
#define GDMA0                       ((GDMA0_Type*)             GDMA0_BASE)
#define GDMA0_CH0                   ((GDMA0_CH0_Type*)         GDMA0_CH0_BASE)
#define GDMA0_CH1                   ((GDMA0_CH0_Type*)         GDMA0_CH1_BASE)
#define SGDMA0                      ((GDMA0_Type*)             SGDMA0_BASE)
#define SGDMA0_CH0                  ((GDMA0_CH0_Type*)         SGDMA0_CH0_BASE)
#define SGDMA0_CH1                  ((GDMA0_CH0_Type*)         SGDMA0_CH1_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif

#endif /* RTL8710C_H */


/** @} */ /* End of group rtl8710c */

/** @} */ /* End of group Realtek Semiconductor Corp. */
